Repository: NiceandGently/caja-actions
Catalog: po/*.po
Languages: ru

source: The parameters of the command to be executed when the user selects the menu item in the file manager context menu or in the toolbar. The parameters may contain some special tokens which are replaced by the information provided by the file manager before starting the command: - up to version 2.0: %d: base folder of the selected file(s) %f: the name of the selected file or the first one if several are selected %h: hostname of the URI %m: space-separated list of the basenames of the selected file(s)/folder(s) %M: space-separated list of the selected file(s)/folder(s), with their full paths %p: port number of the first URI %R: space-separated list of selected URIs %s: scheme of the URI %u: URI %U: username of the URI %%: a percent sign. - starting from version 3: %b: (first) basename %B: space-separated list of the basenames of the selected file(s)/folder(s) %c: count the selected file(s)/folder(s) %d: (first) base directory %D: space-separated list of base directories of the selected file(s)/folder(s) %f: (first) filename %F: space-separated list of the filenames of the selected file(s)/folder(s) %h: hostname of the (first) URI %m: (first) mimetype %M: space-separated list of the mimetypes of the selected file(s)/folder(s) %n: username of the (first) URI %o: no-op operator which forces the singular form of execution (since 3.0.2) %O: no-op operator which forces the plural form of execution (since 3.0.2) %p: port number of the (first) URI %s: scheme of the (first) URI %u: (first) URI %U: space-separated list of the URIs of the selected file(s)/folder(s) %w: (first) basename without the extension %W: space-separated list of basenames without the extension %x: (first) extension %X: space-separated list of the extensions of the selected file(s)/folder(s) %%: a percent sign.
ru: Параметры команды, которая должна быть выполнена, когда пользователь выбирает этот элемент меню в контекстном меню диспетчера файлов или на панели инструментов. Параметры могут содержать некоторые особые маркеры, которые заменяются информацией от диспетчера файлов перед выполнением команды: - до версии 2.0: %d: базовая папка выбранных файлов %f: имя выбранного файла или первого файла, если выбрано несколько %h: имя узла URI %m: разделённый пробелами список базовых имён выбранных файлов/папок %M: разделённый пробелами список выбранных файлов/папок, с полными путями к ним %p: номер порта первого URI %R: разделённый пробелами список выбранных URI %s: схема URI %u: URI %U: имя пользователя URI %%: знак процента. - начиная с версии 3: %b: (первое) базовое имя %B: разделённый пробелами список базовых имён выбранных файлов/папок %c: количество выбранных файлов/папок %d: (первый) базовый каталог %D: разделённый пробелами список базовых каталогов выбранных файлов/папок %f: (первое) имя файла %F: разделённый пробелами список имён выбранных файлов/папок %h: имя узла (первого) URI %m: (первый) тип MIME %M: разделённый пробелами список типов MIME выбранных файлов/папок %n: имя пользователя (первого) URI %o: фиктивный оператор, который принудительно задаёт выполнение действия в одном файле (с 3.0.2) %O: фиктивный оператор, который принудительно задаёт выполнение действия одновременно в нескольких файлах (с 3.0.2) %p: номер порта (первого) URI %s: схема (первого) URI %u: (первый) URI %U: разделённый пробелами список URI выбранных файлов/папок %w: (первое) базовое имя без расширения %W: разделённый пробелами список базовых имён без расширения %x: (первое) расширение %X: разделённый пробелами список расширений выбранных файлов/папок %%: знак процента.

source: Working directory
ru: Рабочий каталог

source: The working directory the command will be started in. Defaults to "%d".
ru: Рабочий каталог, в котором будет запущена команда. По умолчанию — «%d».

source: Execution mode
ru: Режим выполнения

source: Execution mode of the program. This may be chosen between following values: - Normal: starts as a standard graphical user interface - Terminal: starts the preferred terminal of the graphical environment, and runs the command in it - Embedded: makes use of a special feature of the file manager which allows a terminal to be ran inside of it; an acceptable fallback is Terminal - DisplayOutput: the ran terminal may be closed at end of the command, but standard streams (stdout, stderr) should be collected and displayed; an acceptable fallback is Terminal. Defaults to "Normal".
ru: Режим выполнения программы. Можно выбрать одно из следующих значений: - Normal: запускается как стандартный графический интерфейс пользователя - Terminal: запускает предпочтительный терминал графической среды и выполняет в нём команду - Embedded: использует специальную функцию диспетчера файлов, которая позволяет запускать внутри него терминал; в качестве резервного варианта используется значение «Terminal» - DisplayOutput: открытый терминал может быть закрыт по завершению команды, но стандартные потоки (stdout, stderr) будут собраны и отображены; в качестве резервного варианта используется значение «Terminal». По умолчанию — «Normal».

source: Startup notify
ru: Уведомление при запуске

source: Only relevant when ExecutionMode=Normal. Defaults to FALSE.
ru: Применяется только в том случае, если ExecutionMode=Normal. По умолчанию — FALSE.

source: Startup WM Class
ru: Класс для группировки окон приложений при запуске (StartupWMClass)

source: Only relevant when ExecutionMode=Normal. Defaults to empty.
ru: Применяется только в том случае, если ExecutionMode=Normal. По умолчанию — пусто.

source: Execute as user
ru: Выполнить от имени пользователя

source: The user the command must be ran as. The user may be identified by its numeric UID or by its login. The profile is ignored if defined with a non-existing UID or login. Defaults to empty: the command will be executed as the current user.
ru: Пользователь, от имени которого следует выполнить команду. Пользователь может быть идентифицирован по числовому UID или имени учётной записи. Профиль будет проигнорирован, если указан несуществующий UID или имя учётной записи. По умолчанию — пусто; команда будет выполнена от имени текущего пользователя.

source: Error when querying information for %s URI: %s
ru: Ошибка при запросе информации о URI %s: %s

source: user
ru: пользователь

source: Output of the run command
ru: Вывод команды запуска

source: Run command:
ru: Команда запуска:

source: Standard output:
ru: Стандартный вывод:

source: Standard error:
ru: Стандартная ошибка:

source: Caja-Actions Desktop I/O Provider
ru: Поставщик ввода/вывода файлов .desktop программы Caja-Actions

source: Export as a ._desktop file
ru: Экспортировать как файл ._desktop

source: This format has been introduced with v 3.0 series. and should be your newly preferred format when exporting items. It let you easily share your actions with the whole world, including with users of other desktop environments, as long as their own application implements the DES-EMA specification which describes this format. The exported .desktop file may later be imported via : - Import assistant of the Caja-Actions Configuration Tool, - drag-n-drop into the Caja-Actions Configuration Tool, - or by copying it into a XDG_DATA_DIRS/file-manager/actions directory.
ru: Этот формат был введён в версии 3.0, его рекомендуется использовать при экспорте элементов. Благодаря этому формату легко делиться действиями с пользователями по всему миру, в том числе с пользователями других сред рабочего стола (если в их приложении реализована спецификация DES-EMA, которая описывает этот формат). Экспортированный файл .desktop затем можно импортировать с помощью: - помощника импорта программы для настройки Caja-Actions; - перетаскивания файла в программу для настройки Caja-Actions; - копирования файла в каталог XDG_DATA_DIRS/file-manager/actions.

source: The Desktop I/O Provider is not able to handle the URI
ru: Поставщику ввода/вывода файлов .desktop не удалось обработать URI

source: unknown type: %s
ru: неизвестный тип: %s

source: Caja-Actions MateConf I/O Provider
ru: Поставщик ввода/вывода MateConf программы Caja-Actions

source: Item ID not found.
ru: Не найден идентификатор элемента.

source: Unwaited key path %s while importing a menu.
ru: Неожиданный путь к ключу %s при импорте меню.

source: Element %s at line %d already found, ignored.
ru: Элемент %s в строке %d уже обнаружен, игнорируется.

source: Invalid item ID: waited for %s, found %s at line %d.
ru: Некорректный идентификатор элемента: ожидался %s, но обнаружен %s в строке %d.

source: Unknown element %s found at line %d while waiting for %s.
ru: Неизвестный элемент %s обнаружен в строке %d, в то время как ожидался %s.

source: Unknown type %s found at line %d, while waiting for Action or Menu.
ru: Неизвестный тип %s обнаружен в строке %d, в то время как ожидался «Action» или «Menu».

source: The XML I/O Provider is not able to handle the URI
ru: Поставщику ввода/вывода XML не удалось обработать URI

source: Export as a _full MateConf schema file
ru: Экспортировать как _полный файл схемы MateConf

source: This used to be the historical export format. The exported schema file may later be imported via : - Import assistant of the Caja-Actions Configuration Tool, - drag-n-drop into the Caja-Actions Configuration Tool, - or via the mateconftool-2 --import-schema-file command-line tool.
ru: Этот формат исторически использовался для экспорта. Экспортированный файл схемы затем можно импортировать с помощью: - помощника импорта программы для настройки Caja-Actions; - перетаскивания файла в программу для настройки Caja-Actions; - средства командной строки mateconftool-2 --import-schema-file.

source: Export as a _light MateConf schema (v2) file
ru: Экспортировать как _лёгкий файл схемы MateConf (версия 2)

source: This format has been introduced in v 1.11 series. This is the lightest schema still compatible with MateConf command-line tools, while keeping backward compatibility with the Caja-Actions Configuration Tool oldest versions. The exported schema file may later be imported via : - Import assistant of the Caja-Actions Configuration Tool, - drag-n-drop into the Caja-Actions Configuration Tool, - or via the mateconftool-2 --import-schema-file command-line tool.
ru: Этот формат был введён в версии 1.11. Это наиболее легковесная схема, которая также обеспечивает совместимость со средствами командной строки MateConf, сохраняя при этом обратную совместимость с предыдущими версиями программы для настройки Caja-Actions. Экспортированный файл схемы затем можно импортировать с помощью: - помощника импорта программы для настройки Caja-Actions; - перетаскивания файла в программу для настройки Caja-Actions; - средства командной строки mateconftool-2 --import-schema-file.

source: Export as a MateConf _dump file
ru: Экспортировать как файл _дампа MateConf

source: This format has been introduced in v 1.11 series. Tough not backward compatible with Caja-Actions Configuration Tool versions previous to 1.11, it may still be imported via standard MateConf command-line tools. The exported dump file may later be imported via : - Import assistant of the Caja-Actions Configuration Tool (1.11 and above), - drag-n-drop into the Caja-Actions Configuration Tool (1.11 and above), - or via the mateconftool-2 --load command-line tool.
ru: Этот формат был введён в версии 1.11. Он не обеспечивает обратную совместимость с предшествующими 1.11 версиями программы для настройки Caja-Actions, но поддерживает импорт с помощью стандартных средств командной строки MateConf. Экспортированный файл дампа затем можно импортировать с помощью: - помощника импорта программы для настройки Caja-Actions (1.11 и выше); - перетаскивания файла в программу для настройки Caja-Actions (1.11 и выше); - средства командной строки mateconftool-2 --load.

source: Arguments count
ru: Количество аргументов

source: The count of command-line arguments
ru: Количество аргументов командной строки

source: Arguments
ru: Аргументы

source: The array of command-line arguments
ru: Массив аргументов командной строки

source: Option entries
ru: Записи параметров

source: The array of command-line option definitions
ru: Массив определений параметров командной строки

source: Application name
ru: Имя приложения

source: The name of the application
ru: Имя приложения

source: Description
ru: Описание

source: A short description to be displayed in the first line of --help output
ru: Краткое описание, которое будет показано в первой строке вывода --help

source: Icon name
ru: Имя значка

source: The name of the icon of the application
ru: Имя значка приложения

source: UniqueApp name
ru: Уникальное имя

source: The Unique name of the application
ru: Уникальное имя приложения

source: Return code
ru: Код возврата

source: The return code of the application
ru: Код возврата приложения

source: Unable to interpret command-line arguments
ru: Не удалось разобрать аргументы командной строки

source: Quit on Escape
ru: Выход по Escape

source: Should the assistant 'Quit' when the user hits Escape ?
ru: Должен ли помощник завершать работу, когда пользователь нажимает клавишу Escape?

source: Warn on Escape
ru: Предупреждение по Escape

source: Should the user be asked to confirm when exiting the assistant via Escape ?
ru: Должен ли пользователь по нажатию клавиши Escape получить запрос на подтверждение завершения работы помощника?

source: Are you sure you want to quit this assistant ?
ru: Действительно закрыть этот помощник?

source: Another instance of %s is already running. Please switch back to it.
ru: Другой экземпляр %s уже запущен. Пожалуйста, используйте его.

source: The application is not unique
ru: Приложения не является уникальным

source: XML UI filename
ru: Имя файла UI XML

source: The filename which contains the XML UI definition
ru: Имя файла, который содержит определение UI XML

source: Has its own GtkBuilder
ru: Имеет свой собственный GtkBuilder

source: Whether this BaseWindow reallocates a new GtkBuilder each time it is opened
ru: Будет ли это BaseWindow при каждом открытии заново выделять новый GtkBuilder

source: Toplevel name
ru: Имя верхнего уровня

source: The internal GtkBuildable name of the toplevel window
ru: Внутреннее имя GtkBuildable окна верхнего уровня

source: A pointer (not a reference) to the BaseApplication instance
ru: Указатель (не ссылка) на экземпляр BaseApplication

source: Parent BaseWindow
ru: Родительское BaseWindow

source: A pointer (not a reference) to the BaseWindow parent of this BaseWindow
ru: Указатель (не ссылка) на родительское BaseWindow этого BaseWindow

source: WSP name
ru: Имя WSP

source: The string which handles the window size and position in user preferences
ru: Строка, которая управляет размером и положением окна в параметрах пользователя

source: Destroy the Gtk toplevel
ru: Уничтожить верхний уровень Gtk

source: Whether the embedded Gtk Toplevel should be destroyed at dispose time
ru: Должен ли встроенный верхний уровень Gtk быть уничтожен при очистке

source: Unable to load %s UI XML definition: %s
ru: Не удалось загрузить определение UI XML %s: %s

source: Unable to load %s dialog definition.
ru: Не удалось загрузить определение диалога %s.

source: File is not a valid .desktop file
ru: Файл не является корректным файлом .desktop

source: Unrecognized desktop file Version '%s'
ru: Неизвестная версия «%s» файла .desktop

source: Starting %s
ru: Запуск %s

source: Application does not accept documents on command line
ru: Приложение не принимает документы в командной строке

source: Unrecognized launch option: %d
ru: Неизвестный параметр запуска: %d

source: Can't pass document URIs to a 'Type=Link' desktop entry
ru: Не удалось передать URI документов записи «Type=Link» файла .desktop

source: Not a launchable item
ru: Элемент без возможности запуска

source: Disable connection to session manager
ru: Запретить соединение с диспетчером сеансов

source: Specify file containing saved configuration
ru: Указать файл, содержащий сохранённую конфигурацию

source: FILE
ru: ФАЙЛ

source: Specify session management ID
ru: Указать идентификатор управления сеансами

source: ID
ru: Идентификатор

source: Session management options:
ru: Параметры управления сеансами:

source: Show session management options
ru: Показать параметры управления сеансами

source: Caja-Actions Configuration Tool
ru: Программа настройки Caja-Actions

source: A user interface to edit your own contextual actions
ru: Интерфейс пользователя для редактирования созданных вами контекстных действий

source: Set it to run multiple instances of the program [unique]
ru: Задать запуск нескольких экземпляров программы [уникальный]

source: Output the version number, and exit gracefully [no]
ru: Показать номер версии и нормально завершить работу [нет]

source: User is the owner of the item
ru: Пользователь является владельцем элемента

source: Item is readable by the user
ru: Элемент доступен для чтения пользователю

source: Item is writable by the user
ru: Элемент доступен для записи пользователю

source: Item is executable by the user
ru: Элемент доступен для выполнения пользователю

source: Item is local
ru: Элемент является локальным

source: %s (already inserted)
ru: %s (уже вставлено)

source: Adding a new capability
ru: Добавление новой характеристики

source: <b>Managed capabilities</b>
ru: <b>Управляемые характеристики</b>

source: Adding a new scheme
ru: Добавление новой схемы

source: <b>Scheme</b>
ru: <b>Схема</b>

source: Export canceled due to user action.
ru: Экспорт был отменён пользователем.

source: Successfully exported as
ru: Успешно экспортировано как

source: You may not have write permissions on selected folder.
ru: Возможно, вам запрещено выполнять запись в выбранную папку.

source: Exporting actions
ru: Экспорт действий

source: This assistant will guide you through the process of exporting actions.
ru: Этот помощник проведёт вас через процесс экспорта действий.

source: Actions _list :
ru: _Список действий:

source: Please select one or more actions to be exported. You may use Ctrl and Shift keys to extend the selection.
ru: Выберите одно или несколько действий для экспорта. Для расширения выделения можно использовать клавиши Ctrl и Shift.

source: Selecting the exported actions
ru: Выбор действий для экспорта

source: Selecting the target folder
ru: Выбор целевой папки

source: Which format should I use when exporting these items ?
ru: Какой формат следует использовать при экспорте этих элементов?

source: Selecting the export format
ru: Выбор формата экспорта

source: About to export selected items:
ru: Будет выполнен экспорт выбранных элементов:

source: Into the destination folder:
ru: В папку назначения:

source: Summary
ru: Сводка

source: Selected items have been proceeded:
ru: Выбранные элементы были обработаны:

source: Export is done
ru: Экспорт завершён

source: Exporting an action
ru: Экспорт действия

source: Which format should I choose to export it ?
ru: Какой формат следует использовать при его экспорте?

source: Re_member my choice in future export operations
ru: За_помнить мой выбор для будущих операций экспорта

source: Import OK
ru: Успешно импортировано

source: Id.: %s %s
ru: Идентификатор: %s %s

source: Not imported
ru: Не импортировано

source: Importing actions
ru: Импорт действий

source: This assistant will guide you through the process of importing items, actions or menus.
ru: Этот помощник проведёт вас через процесс импорта элементов, действий или меню.

source: Selecting files to import
ru: Выбор файлов для импорта

source: What should I do when importing an item whose ID already exists ?
ru: Что следует сделать, если идентификатор импортируемого элемента уже существует?

source: Managing duplicates
ru: Управление дубликатами

source: About to import selected files:
ru: Будет выполнен импорт выбранных файлов:

source: When importing an item whose ID already exists:
ru: Если идентификатор импортируемого элемента уже существует:

source: Selected files have been proceeded:
ru: Выбранные файлы были обработаны:

source: Import is done
ru: Импорт завершён

source: Configure items to be added to the Caja context menus
ru: Настройка элементов для добавления в контекстные меню Caja

source: The action "%s" is about to be exported.
ru: Будет экспортировано действие «%s».

source: The menu "%s" is about to be exported.
ru: Будет экспортировано меню «%s».

source: Caution: a label is mandatory for the action or the menu.
ru: Внимание: для действия или меню необходимо указать подпись.

source: Basename filter
ru: Фильтр базовых имён

source: Capability filter
ru: Фильтр характеристик

source: Choosing a command
ru: Выбор команды

source: Choosing a working directory
ru: Выбор рабочего каталога

source: Icon Chooser
ru: Выбор значка

source: _Themed icons
ru: _Тематические значки

source: Icons by _path
ru: Значки по _пути

source: (strictly lesser than)
ru: (строго меньше)

source: (equal to)
ru: (равно)

source: (strictly greater than)
ru: (строго больше)

source: Choosing an executable
ru: Выбор исполняемого файла

source: Folder filter
ru: Фильтр папок

source: Select a folder
ru: Выбор папки

source: Mimetype filter
ru: Фильтр типов MIME

source: None
ru: Ничего

source: Me_nu
ru: Ме_ню

source: <b>Menu editable properties</b>
ru: <b>Изменяемые свойства меню</b>

source: _Action
ru: _Действие

source: <b>Action editable properties</b>
ru: <b>Изменяемые свойства действия</b>

source: Scheme filter
ru: Фильтр схем

source: Current NAObjectItem
ru: Текущий NAObjectItem

source: A pointer to the currently edited NAObjectItem, an action or a menu
ru: Указатель на текущий редактируемый NAObjectItem, действие или меню

source: Current NAObjectProfile
ru: Текущий NAObjectProfile

source: A pointer to the currently edited NAObjectProfile
ru: Указатель на текущий редактируемый NAObjectProfile

source: Current NAIContext
ru: Текущий NAIContext

source: A pointer to the currently edited NAIContext
ru: Указатель на текущий редактируемый NAIContext

source: Editable item ?
ru: Редактируемый элемент?

source: Whether the item will be able to be updated against its I/O provider
ru: Можно ли обновить элемент относительно соответствующего поставщика ввода/вывода

source: No edition reason
ru: Нет причины редактирования

source: Why is this item not editable
ru: Почему этот элемент не является редактируемым

source: One or more actions have been modified in the filesystem. You could keep to work with your current list of actions, or you may want to reload a fresh one.
ru: В файловой системе было изменено одно или несколько действий. Вы можете продолжить работу с текущим списком действий или перезагрузить его для получения этих изменений.

source: Note that reloading a fresh list of actions requires that you give up with your current modifications.
ru: Обратите внимание, что при перезагрузке списка действий все ваши текущие изменения будут потеряны.

source: Do you want to reload a fresh list of actions ?
ru: Перезагрузить список действий?

source: Reloading a fresh list of actions requires that you give up with your current modifications.
ru: При перезагрузке списка действий все ваши текущие изменения будут потеряны.

source: Do you really want to do this ?
ru: Продолжить?

source: Some items have been modified.
ru: Некоторые элементы были изменены.

source: Are you sure you want to quit without saving them ?
ru: Действительно выйти, не сохранив их?

source: Must match one of
ru: Должно соответствовать одному из следующих

source: Must match all of
ru: Должно соответствовать всем следующим

source: Must not match any of
ru: Не должно соответствовать ни одному из следующих

source: '%s' filter already exists in the list. Please provide another one.
ru: Фильтр «%s» уже имеется в списке. Задайте другой фильтр.

source: new-filter
ru: новый-фильтр

source: _File
ru: _Файл

source: _Edit
ru: _Правка

source: _View
ru: _Вид
