Repository: NiceandGently/caja-actions
Catalog: po/*.po
Languages: ru

source: Defines the list of valid schemes to be matched against the selected items. The scheme is the protocol used to access the files. The keyword to use is the one used in the URI by the file manager. Examples of valid URI include: - file:///tmp/foo.txt - sftp:///root@test.example.net/tmp/foo.txt The most common schemes are: 'file': local files 'sftp': files accessed via SSH 'ftp': files accessed via FTP 'smb': files accessed via Samba (Windows share) 'dav': files accessed via WebDAV. All schemes used by your favorite file manager may be used here. This obviously only applies when there is a selection, or when targeting the special 'x-caja-desktop' scheme. Defaults to 'file'.
ru: Определяет список действительных схем для сравнения с выбранными элементами. Схема является протоколом для получения доступа к файлам. Используется то же ключевое слово, которое диспетчер файлов использует в URI. Примеры корректных URI: - file:///tmp/foo.txt - sftp:///root@test.example.net/tmp/foo.txt Наиболее распространёнными схемами являются: «file»: локальные файлы «sftp»: файлы, доступные через SSH-соединение «ftp»: файлы в FTP-каталоге «smb»: файлы в Windows-сети (Samba) «dav»: файлы, доступные через WebDAV-соединение Здесь могут быть применены все используемые вашим диспетчером файлов схемы. Применяется только при наличии выделения или при выборе особой схемы «x-caja-desktop». По умолчанию — «file».

source: A valid GIO scheme where the selected file(s)/folder(s) should be located. You must set one option for each scheme you need
ru: Корректная схема GIO, в которой должны находиться выбранные файлы/папки. Укажите один вариант для каждой схемы, которая будет использоваться.

source: <STRING>
ru: <СТРОКА>

source: List of folders
ru: Список папок

source: Defines the list of valid paths to be matched against the current folder. All folders 'under' the specified path are considered valid. Defaults to '/'.
ru: Определяет список корректных путей, которые будут сопоставляться текущей папке. Все папки, находящиеся «ниже» указанного пути, считаются корректными. По умолчанию — «/».

source: The path of a (parent) directory for which the item will be displayed. You must set one option for each folder you need
ru: Путь к (родительскому) каталогу, для которого будет показан элемент. Укажите один вариант для каждой папки, которая будет использоваться.

source: <PATH>
ru: <ПУТЬ>

source: Operator of the selection count relation
ru: Оператор количества элементов в выделении

source: Whether this profile may be selected depending of the count of the selection. This is a string of the form "{'<'|'='|'>'} number". Examples of valid strings are: "=0", "> 1", "< 10". Defaults to ">0".
ru: Количество элементов в выделении определяет, можно ли выбрать профиль. Это строка вида «{'<'|'='|'>'} число». Примеры корректных строк: «=0», «> 1», «< 10». По умолчанию — «>0».

source: Selection count relation [>0]
ru: Количество элементов в выделении [>0]

source: Only show in environment
ru: Показывать только в среде

source: Defaults to all.
ru: По умолчанию — все.

source: The name of an only desktop environment where the item must be displayed. You must set one option for each environment you want
ru: Имя единственной среды рабочего стола, в которой будет показан элемент.Укажите один вариант для каждой среды, которая будет использоваться.

source: <DESKTOP>
ru: <РАБОЧИЙ СТОЛ>

source: Not show in environment
ru: Не показывать в среде

source: Defaults to none.
ru: По умолчанию — нет.

source: The name of a desktop environment where the item must not be displayed. You must set one option for each environment you want
ru: Имя среды рабочего стола, в которой не будет показан элемент.Укажите один вариант для каждой среды, которая будет использоваться.

source: Try exec
ru: Попытка выполнения

source: Note that, when specified, only the presence and the executability status of the specified file are checked. Parameters may appear in 'TryExec' value, and will be substituted at runtime. Defaults to successful.
ru: Если этот параметр указан, будут проверяться только наличие и состояние выполнимости указанного файла. Параметры, которые могут появляться в значении «TryExec», будут заменяться во время выполнения. По умолчанию — успешно.

source: the path to a file whose executability is to be checked
ru: путь к файлу, который следует проверить на выполнимость

source: Show if registered
ru: Показать, если зарегистрировано

source: The well-known name of a DBus service. The item will be candidate if the named service is registered on session DBus at runtime. Parameters may appear in 'ShowIfRegistered' value, and will be substituted at runtime. Defaults to successful.
ru: Известное имя службы DBus. Элемент будет кандидатом, если именованная служба зарегистрирована в сеансе DBus во время выполнения. Параметры, которые могут появляться в значении «ShowIfRegistered», будут заменяться во время выполнения. По умолчанию — успешно.

source: The name of a service which must be registered on session DBus
ru: Имя службы, которая должна быть зарегистрирована в сеансе DBus

source: <NAME>
ru: <ИМЯ>

source: Show if True
ru: Показать, если значение «true»

source: A command which, when executed, should output a string on stdout. The item will be candidate if the outputed string is equal to "true". Parameters may appear in 'ShowIfTrue' value, and will be substituted at runtime. Defaults to successful.
ru: Команда, которая при выполнении должна выводить строку в стандартный вывод (stdout). Элемент будет кандидатом, если выведенная строка имеет значение «true». Параметры, которые могут появляться в значении «ShowIfTrue», будут заменяться во время выполнения. По умолчанию — успешно.

source: The path to a command which will display the 'true' string
ru: Путь к команде, которая отобразит строку «true»

source: Show if running
ru: Показать, если выполняется

source: The name of a process. The item will be candidate if the process name is found in memory at runtime. Parameters may appear in 'ShowIfRunning' value, and will be substituted at runtime. Defaults to successful.
ru: Имя процесса. Элемент будет кандидатом, если имя процесса найдено в памяти во время выполнения. Параметры, которые могут появляться в значении «ShowIfRunning», будут заменяться во время выполнения. По умолчанию — успешно.

source: The name of a binary which must be running
ru: Имя бинарного файла, который должен выполняться

source: Capabilities
ru: Характеристики

source: A list of capabilities each item of the selection must satisfy in order for the item to be candidate. Capabilities may be negated. Capabilities have to be chosen between following predefined ones: - 'Owner': current user is the owner of selected items - 'Readable': selected items are readable by user (probably more useful when negated) - 'Writable': selected items are writable by user - 'Executable': selected items are executable by user - 'Local': selected items are local. Defaults to empty list.
ru: Список характеристик, которому должен удовлетворять каждый элемент выделения, чтобы стать кандидатом. Характеристики могут быть отрицаемыми («не»). Выбирать характеристики можно только из следующего перечня предустановленных характеристик: - «Owner»: текущий пользователь является владельцем выбранных элементов - «Readable»: выбранные элементы доступны для чтения пользователю (вероятно, эту характеристику целесообразнее использовать в отрицаемом варианте) - «Writable»: выбранные элементы доступны для записи пользователю - «Executable»: выбранные элементы доступны для выполнения пользователю - «Local»: выбранные элементы являются локальными. По умолчанию — пустой список.

source: The name of a capability the selection must meet. May be 'Owner', 'Readable', 'Writable', 'Executable' or 'Local'
ru: Имя характеристики, которому должно удовлетворять выделение. Возможные варианты: «Owner», «Readable», «Writable», «Executable» или «Local»

source: Item was renumbered because the caller did not provide any check function.
ru: Элемент был перенумерован, так как вызывающий объект не предоставил функции проверки.

source: Item was renumbered because the caller did not provide any ask user function.
ru: Элемент был перенумерован, так как вызывающий объект не предоставил функции запроса у пользователя.

source: Item was renumbered due to user request.
ru: Элемент был перенумерован по запросу пользователя.

source: Existing item was overridden due to user request.
ru: Существующий элемент был заменён по запросу пользователя.

source: Item %s already exists.
ru: Элемент %s уже существует.

source: Import was canceled due to user request.
ru: Импорт был отменён по запросу пользователя.

source: (renumbered)
ru: (перенумеровано)

source: Do _not import the item
ru: _Не импортировать элемент

source: This used to be the historical behavior. The selected file will be marked as "NOT OK" in the Summary page. The existing item will not be modified.
ru: Это поведение использовалось исторически. Выбранный файл будет отмечен как «NOT OK» на странице «Сводка». Существующий элемент не будет изменён.

source: Import the item, _allocating it a new identifier
ru: Импортировать элемент, _назначив ему новый идентификатор

source: The selected file will be imported with a slightly modified label indicating the renumbering. The existing item will not be modified.
ru: Выбранный файл будет импортирован с немного изменённой подписью, указывающей на перенумерацию. Существующий элемент не будет изменён.

source: _Override the existing item
ru: _Заменить существующий элемент

source: The item found in the selected file will silently override the current one which has the same identifier. Be warned: this mode may be dangerous. You will not be prompted another time.
ru: Элемент, обнаруженный в выбранном файле, без уведомлений заменит текущий элемент, который имеет такой же идентификатор. Учтите, использовать этот режим необходимо с осторожностью. В следующий раз вы не будете предупреждены.

source: You will be asked each time an imported ID already exists.
ru: Если импортируемый идентификатор уже существует, вы получите соответствующий запрос.

source: %s is not loadable (empty or too big or not a regular file)
ru: Не удалось загрузить %s (файл либо является пустым или слишком большим, либо не является обычным файлом)

source: Unable to load 'ImporterAskDialog' from %s
ru: Не удалось загрузить «ImporterAskDialog» из %s

source: The action "%s" imported from "%s" has the same identifiant than the already existing "%s".
ru: Действие «%s», импортированное из «%s», имеет тот же идентификатор, что и уже существующее «%s».

source: The menu "%s" imported from "%s" has the same identifiant than the already existing "%s".
ru: Меню «%s», импортированное из «%s», имеет тот же идентификатор, что и уже существующее «%s».

source: Already existing item
ru: Уже существующий элемент

source: What should I do with this ?
ru: Что следует предпринять?

source: Re_member my choice in future import operations
ru: За_помнить мой выбор для будущих операций импорта

source: Please, be kind enough to fill out a bug report on https://bugzilla.gnome.org/enter_bug.cgi?product=caja-actions.
ru: Пожалуйста, отправьте сообщение об ошибке по адресу https://bugzilla.gnome.org/enter_bug.cgi?product=caja-actions.

source: Unavailable I/O provider.
ru: Недоступный поставщик ввода/вывода.

source: I/O provider implementation lacks of required API.
ru: Реализация поставщика ввода/вывода не содержит требуемого API.

source: I/O provider is not willing to write.
ru: Поставщик ввода/вывода не может выполнить запись.

source: I/O provider announces itself as unable to write.
ru: Поставщик ввода/вывода объявляет, что не может выполнить запись.

source: I/O provider has been locked down by an administrator.
ru: Поставщик ввода/вывода заблокирован администратором.

source: I/O provider has been locked down by the user.
ru: Поставщик ввода/вывода заблокирован пользователем.

source: Item is read-only.
ru: Элемент только для чтения.

source: No writable I/O provider found.
ru: Не найден поставщик ввода/вывода для записи.

source: Item is not writable for an unknown reason (%d). %s
ru: Элемент по неизвестной причине не поддерживает запись (%d). %s

source: Program flow error. %s
ru: Ошибка потока программы. %s

source: The I/O provider is not willing to do that.
ru: Поставщик ввода/вывода не может выполнить эту операцию.

source: Write error in I/O provider.
ru: Ошибка записи в поставщике ввода/вывода.

source: Unable to delete MateConf schemas.
ru: Не удалось удалить схемы MateConf.

source: Unable to delete configuration.
ru: Не удалось удалить конфигурацию.

source: Unknown return code (%d). %s
ru: Неизвестный код возврата (%d). %s

source: New Caja action
ru: Новое действие Caja

source: Profile automatically created from pre-v2 action
ru: Профиль, автоматически созданный из действия, созданного в версии ниже 2

source: Targets the selection context menu
ru: Цель — контекстное меню выделения

source: Whether the action targets the selection file manager context menus. This used to be the historical behavior. Note that menus are always potential candidate to the display in selection context menus provided that they contain at least one action. Defaults to TRUE.
ru: Являются ли целью действия контекстные меню выделения диспетчера файлов. Это поведение использовалось исторически. Обратите внимание, что меню всегда являются потенциальными кандидатами на отображение в контекстных меню выделения, если они содержат хотя бы одно действие. По умолчанию — TRUE.

source: Targets the selection context menu [true]
ru: Цель — контекстное меню выделения [true]

source: Targets the location context menu
ru: Цель — контекстное меню расположения

source: Whether the action targets the file manager context menus when there is no selection, thus applying to current location. Note that menus are always potential candidate to the display in selection context menus provided that they contain at least one action. Defaults to FALSE
ru: Являются ли целью действия контекстные меню диспетчера файлов в случае отсутствии выделения, то есть применимо к текущему расположению. Обратите внимание, что меню всегда являются потенциальными кандидатами на отображение в контекстных меню выделения, если они содержат хотя бы одно действие. По умолчанию — FALSE

source: Targets the location context menu [false]
ru: Цель — контекстное меню расположения [false]

source: Targets the toolbar
ru: Цель — панель инструментов

source: Whether the action is candidate to be displayed in file manager toolbar. This only applies to current location. Note that menus are never displayed in the toolbar. Defaults to FALSE.
ru: Является ли действие кандидатом на отображение на панели инструментов диспетчера файлов. Применяется только к текущему расположению. Обратите внимание, что меню никогда не показываются на панели инструментов. По умолчанию — FALSE.

source: Targets the toolbar [false]
ru: Цель — панель инструментов [false]

source: Label of the toolbar item
ru: Подпись элемента панели инструментов

source: The label displayed besides of the icon in the file manager toolbar. Note that actual display may depend of your own Desktop Environment preferences. Defaults to label of the context menu when not set or empty.
ru: Подпись, которая отображается рядом со значком на панели инструментов диспетчера файлов. Обратите внимание, что фактическое отображение может зависеть от ваших собственных параметров настройки среды рабочего стола. По умолчанию — подпись контекстного меню (когда параметр не установлен или пуст).

source: Copy of %s
ru: Копия %s

source: Type of the item
ru: Тип элемента

source: Defines if the item is an action or a menu. Possible values are : - 'Action', - 'Menu'. The value is case sensitive and must not be localized.
ru: Определяет, является ли элемент действием или меню. Возможные значения : - «Action» (действие), - «Menu» (меню). Значение чувствительно к регистру и не должно переводиться.

source: Label of the context menu item (mandatory)
ru: Подпись элемента контекстного меню (обязательно)

source: The label of the menu item that will appear in the file manager context menu when the selection matches the appearance condition settings. It is also used as a default for the toolbar label of an action.
ru: Подпись элемента меню, которая будет показана в контекстном меню диспетчера файлов в случае соответствия выделения заданным критериям. Она также используется как подпись панели инструментов действия по умолчанию.

source: Empty label
ru: Пустая подпись

source: Tooltip of the context menu item
ru: Всплывающая подсказка для элемента контекстного меню

source: The tooltip of the menu item that will appear in the file manager statusbar when the user points to the file manager context menu item with his/her mouse.
ru: Всплывающая подсказка для элемента меню, появляющаяся в строке состояния диспетчера файлов при наведении курсора на этот элемент.

source: Icon of the context menu item
ru: Значок элемента контекстного меню

source: The icon of the menu item that will appear next to the label in the file manager context menu when the selection matches the appearance conditions settings. May be the localized name of a themed icon, or a full path to any appropriate image.
ru: Значок элемента меню, который будет показан рядом с подписью в контекстном меню диспетчера файлов в случае соответствия выделения заданным критериям. Может являться локализованным именем тематического значка или полным путём к любому подходящему изображению.

source: <PATH|NAME>
ru: <ПУТЬ|ИМЯ>

source: Description relative to the item
ru: Описание элемента

source: Some text which explains the goal of the menu or the action. May be used, e.g. when displaying available items on a web site.
ru: Текст, поясняющий назначение меню или действия. Может использоваться, например, при отображении доступных элементов на веб-сайте.

source: Suggested shortcut
ru: Предлагаемая комбинация клавиш

source: A shortcut suggested for the action or the menu. Please note that this might be only a suggestion as the shortcut may be already reserved for another use. Implementation should not override an already existing shortcut to define this one. The format may look like "<Control>a" or "<Shift><Alt>F1". Defaults to empty.
ru: Комбинация клавиш, предлагаемая для действия или меню. Обратите внимание, что это лишь предложение — данная комбинация клавиш может уже использоваться. Реализация не должна переназначать уже существующую комбинацию клавиш, чтобы определить эту. Формат может иметь следующий вид: «<Control>a» или «<Shift><Alt>F1». По умолчанию — пусто.

source: List of subitem ids
ru: Список идентификаторов подэлементов

source: Ordered list of the IDs of the subitems. This may be actions or menus if the item is a menu, or profiles if the item is an action. If this list doesn't exist or is empty for an action or a menu, subitems are attached in the order of the read operations.
ru: Упорядоченный список идентификаторов подэлементов. Это могут быть действия или меню, если элемент представляет собой меню, или профили, если элемент представляет собой действие. Если для действия или меню этот список не существует или является пустым, подэлементы добавляются в порядке операций чтения.

source: Whether the action or the menu is enabled
ru: Включено ли действие или меню

source: If the or the menu action is disabled, it will never appear in the file manager context menu. Defaults to TRUE.
ru: Если действие или меню отключено, оно не будет показано в контекстном меню диспетчера файлов. По умолчанию — TRUE.

source: Whether the action or the menu is enabled [enabled]
ru: Включено ли действие или меню [enabled]

source: Version of the format
ru: Версия формата

source: The version of the configuration format that will be used to manage backward compatibility.
ru: Версия формата конфигурации, которая будет использована для обеспечения обратной совместимости.

source: New Caja menu
ru: Новое меню Caja

source: Default profile
ru: Профиль по умолчанию

source: Name of the profile
ru: Имя профиля

source: May be used as a description for the function of the profile. If not set, it defaults to an auto-generated name.
ru: Может использоваться как описание функции профиля. Если не установлено, по умолчанию используется автоматически созданное имя.

source: Path of the command
ru: Путь к команде

source: The path of the command to be executed when the user select the menu item in the file manager context menu or in the toolbar.
ru: Путь к команде, которая должна быть выполнена, когда пользователь выбирает этот элемент меню в контекстном меню диспетчера файлов или на панели инструментов.

source: Parameters of the command
ru: Параметры команды
