Repository: NiceandGently/caja-actions
Catalog: po/*.po
Languages: ru

source: The default working directory the command should be started in.
ru: Рабочий каталог по умолчанию, в котором следует запустить команду.

source: B_rowse...
ru: О_бзор...

source: Example
ru: Пример

source: <b>Command</b>
ru: <b>Команда</b>

source: This tab lets you choose the command to be executed, along with its parameters. Defining several profiles lets you have several commands, each applying with a different set of conditions.
ru: На этой вкладке можно выбрать команду для выполнения и её параметры. Если задать несколько профилей, можно использовать несколько команд, при этом каждая из них применяется с собственным набором условий.

source: _Command
ru: _Команда

source: _Normal
ru: _Обычный

source: The command will be started as a standard graphical user interface.
ru: Команда будет запущена как стандартный графический интерфейс пользователя.

source: In a _terminal
ru: В _терминале

source: The command will be started in the preferred terminal of the graphical environment.
ru: Команда будет запущена в предпочтительном терминале графической среды.

source: _Embedded
ru: _Встроенный

source: This option makes use of a special feature of the file manager, which would allow a terminal to be ran inside of it. An acceptable fallback is running in the standard terminal.
ru: Этот параметр использует специальную функцию диспетчера файлов, которая позволяет запускать внутри него терминал. В качестве резервного варианта используется выполнение в стандартном терминале.

source: _Display output
ru: _Показать вывод

source: The command will be run in a terminal. The terminal will be closed at the end of the execution; standard error and output streams will be displayed. An acceptable fallback is running in the standard terminal.
ru: Команда будет выполнена в терминале. Терминал будет закрыт по завершению выполнения; будут показаны стандартные потоки (stdout, stderr). В качестве резервного варианта используется выполнение в стандартном терминале.

source: <b>Execution mode</b>
ru: <b>Режим выполнения</b>

source: Note: this is not yet implemented in Caja-Actions.
ru: Примечание: эта возможность ещё не реализована в Caja-Actions.

source: _Startup notify
ru: _Уведомление при запуске

source: When checked, it is known that the run command will send a "remove" message to the desktop environment. See the Startup Notification Protocol Specification for more details. Only relevant when chosen execution mode is Normal.
ru: Если этот параметр отмечен, команда запуска отправит сообщение «удалить» среде рабочего стола. Дополнительные сведения доступны в спецификации протокола уведомлений при запуске (Startup Notification Protocol). Применяется только в том случае, если выбран режим выполнения «Normal».

source: Startup Window Manager _class :
ru: _Класс для группировки окон приложений при запуске:

source: When specified, this should be the name of a WM class of at least one window of the run command. See the Startup Notification Protocol Specification for more details. Only relevant when chosen execution mode is Normal.
ru: Если указано, это должно быть имя WM-класса хотя бы одного окна команды запуска. Дополнительные сведения доступны в спецификации протокола уведомлений при запуске (Startup Notification Protocol). Применяется только в том случае, если выбран режим выполнения «Normal».

source: <b>Startup mode</b>
ru: <b>Режим запуска</b>

source: Note: this is not yet implemented in Caja-Actions.
ru: Примечание: эта возможность ещё не реализована в Caja-Actions.

source: Execute as _user :
ru: Выполнить от имени _пользователя :

source: Enter here the user the command should be ran as. The user may be defined by his numeric UID or his login name. Leave the field empty to run the command as the current user.
ru: Введите пользователя, от имени которого следует выполнить команду. Пользователь может быть определён по числовому UID или имени учётной записи. Оставьте это поле пустым, чтобы выполнить команду от имени текущего пользователя.

source: <b>Execute as user</b>
ru: <b>Выполнение от имени пользователя</b>

source: This advanced tab lets you precisely define how your command will be executed.
ru: На этой вкладке с расширенными параметрами можно указать, как именно следует выполнить команду.

source: E_xecution
ru: В_ыполнение

source: The current item will appear if the basename of each element of the selection matches one filter of the 'Must match one of' column, while not matching any of the filters of the 'Must not match any of' column.
ru: Текущий элемент будет показан, если базовое имя каждого элемента выделения соответствует одному из фильтров в столбце «Должно соответствовать одному из следующих» и не соответствует ни одному из фильтров в столбце «Не должно соответствовать ни одному из следующих».

source: This list lets you determine for which basenames the currently selected item will be displayed in the Caja context menu. Basenames may use '*' and '?' wildcards. Basenames may be negated to specify for which basenames your item must not appear.
ru: С помощью этого списка можно определить, для каких базовых имён текущий выбранный элемент будет показан в контекстном меню Caja. В базовых именах могут использоваться подстановочные знаки («*» и «?»). Базовые имена можно использовать в отрицаемом варианте, чтобы указать, для каких базовых имён элемент не должен отображаться.

source: Click to add a new basename filter.
ru: Нажмите для добавления нового фильтра базовых имён.

source: Click to remove the current basename filter.
ru: Нажмите для удаления текущего фильтра базовых имён.

source: Match _case
ru: С учётом _регистра

source: Click to define the above basename filters as case sensitive.
ru: Нажмите, чтобы определить вышеприведённые фильтры базовых имён как чувствительные к регистру.

source: <b>Basenames conditions</b>
ru: <b>Условия для базовых имён</b>

source: This tab lets you determine for which basenames the currently selected item will be displayed in the Caja context menu. Basenames may be negated to specify for which basenames your item must not appear.
ru: На этой вкладке можно определить, для каких базовых имён текущий выбранный элемент будет показан в контекстном меню Caja. Базовые имена можно использовать в отрицаемом варианте, чтобы указать, для каких базовых имён элемент не должен отображаться.

source: _Basenames
ru: _Базовые имена

source: The current item will appear if the mimetype of each element of the selection matches one filter of the 'Must match one of' column, while not matching any of the filters of the 'Must not match any of' column.
ru: Текущий элемент будет показан, если тип MIME каждого элемента выделения соответствует одному из фильтров в столбце «Должно соответствовать одному из следующих» и не соответствует ни одному из фильтров в столбце «Не должно соответствовать ни одному из следующих».

source: This list lets you determine for which mimetypes the currently selected item will be displayed in the Caja context menu. Mimetypes may be specified as '*', '*/*', 'group/*' or 'group/subgroup'. Mimetypes may be negated to specify for which type of objects your item must not appear.
ru: С помощью этого списка можно определить, для каких типов MIME текущий выбранный элемент будет показан в контекстном меню Caja. Типы MIME можно указывать как «*», «*/*», «group/*» или «group/subgroup». Типы MIME можно использовать в отрицаемом варианте, чтобы указать, для какого типа объектов элемент не должен отображаться.

source: Click to add a new mimetype filter.
ru: Нажмите для добавления нового фильтра типов MIME.

source: Click to remove the current mimetype filter.
ru: Нажмите для удаления текущего фильтра типов MIME.

source: <b>Mimetypes conditions</b>
ru: <b>Условия для типов MIME</b>

source: This tab lets you determine for which mimetypes the currently selected item will be displayed in the Caja context menu. Mimetypes may be specified as '*', '/*', 'group/*' or 'group/subgroup'. Mimetypes may be negated to specify for which type of objects your item must not appear.
ru: На этой вкладке можно определить, для каких типов MIME текущий выбранный элемент будет показан в контекстном меню Caja. Типы MIME можно указывать как «*», «/*», «group/*» или «group/subgroup». Типы MIME можно использовать в отрицаемом варианте, чтобы указать, для какого типа объектов элемент не должен отображаться.

source: _Mimetypes
ru: _Типы MIME:

source: The current item will appear if the location of each element of the selection is one or inside one of the paths of the 'Must match one of' column, while not being one or inside one of the 'Must not match any of' column.
ru: Текущий элемент будет показан, если расположение каждого элемента выделения совпадает или находится по одному из путей в столбце «Должно соответствовать одному из следующих» и не совпадает и не находится по одному из путей в столбце «Не должно соответствовать ни одному из следующих».

source: This list lets you determine where (in which folders) the currently selected files must be found in order for the item to be displayed in the Caja context menu. Folders may use '*' or '?' wildcards. Folder filters may be negated to specify for which folders your item must not appear.
ru: С помощью этого списка можно определить, где (в каких папках) должны находиться текущие выбранные файлы, чтобы элемент был показан в контекстном меню Caja. В именах папок могут использоваться подстановочные знаки («*» и «?»). Фильтры папок можно использовать в отрицаемом варианте, чтобы указать, в каких папках элемент не должен отображаться.

source: Click to add a new folder filter.
ru: Нажмите для добавления нового фильтра папок.

source: Click to browse the filesystem in order to select a new folder filter.
ru: Нажмите, чтобы просмотреть файловую систему для выбора нового фильтра папок.

source: Click to remove the current folder filter.
ru: Нажмите для удаления текущего фильтра папок.

source: <b>Folders conditions</b>
ru: <b>Условия для папок</b>

source: This tab lets you determine where (in which folders) the currently selected files must be found in order for the item to be displayed in the Caja context menu. Folder filters may be negated to specify for which folders your item must not appear.
ru: На этой вкладке можно определить, где (в каких папках) должны находиться текущие выбранные файлы, чтобы элемент был показан в контекстном меню Caja. Фильтры папок можно использовать в отрицаемом варианте, чтобы указать, в каких папках элемент не должен отображаться.

source: _Folders
ru: _Папки

source: The current item will appear if the scheme of each element of the selection matches one of the 'Must match one of' column, while not matching any of the 'Must not match any of' column.
ru: Текущий элемент будет показан, если схема каждого элемента выделения соответствует одному из критериев в столбце «Должно соответствовать одному из следующих» и не соответствует ни одному из критериев в столбце «Не должно соответствовать ни одному из следующих».

source: This list lets you determine which schemes the currently selected files must satisfy in order for the item to be displayed in the Caja context menu. Filters may be negated to specify for which schemes your item must not appear.
ru: С помощью этого списка можно определить, каким схемам должны удовлетворять текущие выбранные файлы, чтобы элемент был показан в контекстном меню Caja. Фильтры можно использовать в отрицаемом варианте, чтобы указать, для каких схем элемент не должен отображаться.

source: Click to add a new scheme filter.
ru: Нажмите для добавления нового фильтра схем.

source: De_faults...
ru: Πо _умолчанию...

source: Click to select a new scheme filter among default schemes.
ru: Нажмите для выбора нового фильтра схем среди схем по умолчанию.

source: Click to remove the current scheme filter.
ru: Нажмите для удаления текущего фильтра схем.

source: <b>Schemes conditions</b>
ru: <b>Условия для схем</b>

source: This tab lets you determine which schemes the currently selected files must satisfy in order for the item to be displayed in the Caja context menu. Filters may be negated to specify for which schemes your item must not appear.
ru: На этой вкладке можно определить, каким схемам должны удовлетворять текущие выбранные файлы, чтобы элемент был показан в контекстном меню Caja. Фильтры можно использовать в отрицаемом варианте, чтобы указать, для каких схем элемент не должен отображаться.

source: The current item will appear if each element of the selection matches all capabilities of the 'Must match all of' column, while not matching any capability of the 'Must not match any of' column.
ru: Текущий элемент будет показан, если каждый элемент выделения соответствует всем характеристикам в столбце «Должно соответствовать всем следующим» и не соответствует ни одной из характеристик в столбце «Не должно соответствовать ни одному из следующих».

source: This list lets you determine which capabilities the currently selected files must satisfy in order for the item to be displayed in the Caja context menu. Capabilities may be negated to specify for which capabilities your item must not appear.
ru: С помощью этого списка можно определить, каким характеристикам должны удовлетворять текущие выбранные файлы, чтобы элемент был показан в контекстном меню Caja. Характеристики можно использовать в отрицаемом варианте, чтобы указать, для каких характеристик элемент не должен отображаться.

source: Click to add a new capability filter.
ru: Нажмите для добавления фильтра характеристик.

source: Click to remove the current capability.
ru: Нажмите для удаления текущего фильтра характеристик.

source: <b>Capabilities conditions</b>
ru: <b>Условия для характеристик</b>

source: This tab lets you determine which capabilities the currently selected files must satisfy in order for the item to be displayed in the Caja context menu. Filters may be negated to specify for which capabilities your item must not appear.
ru: На этой вкладке можно определить, каким характеристикам должны удовлетворять текущие выбранные файлы, чтобы элемент был показан в контекстном меню Caja. Фильтры можно использовать в отрицаемом варианте, чтобы указать, для каких характеристик элемент не должен отображаться.

source: Ca_pabilities
ru: Ха_рактеристики

source: This is an advanced condition based on the count of the current selection. If the current selection does not match this condition, then the item will not be displayed in the file manager context menus or toolbar.
ru: Это расширенное условие, которое основывается на количестве элементов в текущем выделении. Если текущее выделение не соответствует этому условию, элемент не будет показан в контекстных меню или в панели инструментов диспетчера файлов.

source: _Count :
ru: _Количество:

source: <b>Appears if selection contains</b>
ru: <b>Появляется, если выделенное содержит</b>

source: This is an advanced condition based on the running desktop environment. First choose on the left if the item depends of a particular desktop environment, then select on the right the adequate desktop environment.
ru: Это расширенное условие, которое основывается на текущей среде рабочего стола. Сначала выберите в области слева, зависит ли элемент от конкретной среды рабочего стола, затем выберите подходящую среду рабочего стола в области справа.

source: Item may appear depending of the desktop environment.
ru: Отображение элемента зависит от среды рабочего стола.

source: _Always appears
ru: Отображается _всегда

source: _Only appears in selected environments
ru: Отображается _только в выбранных средах

source: _Never appears in selected environments
ru: _Не отображается в выбранных средах

source: Appears if the file is e_xecutable :
ru: Отображается, если файл является _исполняемым:

source: This is an advanced condition based on the presence of an executable file on the file system. This may be used for example to test for a prerequisite package.
ru: Это расширенное условие, которое основывается на наличии исполняемого файла в файловой системе. Оно может использоваться, например, для проверки наличия необходимого пакета.

source: Bro_wse...
ru: О_бзор...

source: Appears if the name is _registered on D-Bus :
ru: Отображается, если имя _зарегистрировано в D-Bus:

source: This is an advanced condition based on the presence of a particular service on the D-Bus system. This may be used for example for testing that a prerequisite service is currently available.
ru: Это расширенное условие, которое основывается на наличии конкретной службы в системе D-Bus. Оно может использоваться, например, для проверки доступности необходимой службы.

source: Appears if the command outputs "_true" :
ru: Отображается, если команда выводит «_true»:

source: This is an advanced condition based on a runtime result. Enter here a command which is able to display the exact "true" string on its standard output. This may be used for example for testing a complex condition.
ru: Это расширенное условие, которое основывается на результате выполнения. Введите команду, которая может показать точную строку «true» в своём стандартном выводе. Оно может использоваться, например, для проверки сложного условия.

source: Appears if the _binary is running :
ru: Отображается, если выполняется _бинарный файл:

source: This is an advanced condition based on the presence of a running binary. Note that only the basename of the binary is checked, not its dirname nor its parameters. This may be used for example for testing the presence of a prerequisite daemon.
ru: Это расширенное условие, которое основывается на наличии выполняющегося бинарного файла. Обратите внимание, что проверяется только базовое имя бинарного файла, а не имя каталога, в котором он находится, или параметры этого файла. Оно может использоваться, например, для проверки наличия необходимой фоновой службы.

source: Brow_se...
ru: Об_зор...

source: <b>Execution environment</b>
ru: <b>Среда выполнения</b>

source: This tab lets you determine some advanced conditions the currently selected files must satisfy in order for the item to be displayed in the file manager context menu.
ru: На этой вкладке можно определить расширенные условия, которым должны удовлетворять текущие выбранные файлы, чтобы элемент был показан в контекстном меню диспетчера файлов.

source: _Environment
ru: _Среда

source: _Description :
ru: _Описание:

source: Enter here a free text which may be used (e.g. in a Web service or in a search tool) to describe your item.
ru: Введите текст, который может использоваться (например, в веб-сервисе или средстве поиска) для описания элемента.

source: E_nabled
ru: В_ключено

source: Check the box to enable this item. If unchecked, then the item will never appear in the file manager context menus or toolbar.
ru: Установите флажок для включения этого элемента. Если флажок не установлен, элемент не будет показан в контекстных меню или в панели управления диспетчера задач.

source: Suggested _shortcut :
ru: Предлагаемая _комбинация клавиш:

source: Enter here the keyboard touch combination you suggest as a shortcut to your action. Note: this is not yet implemented in Caja-Actions.
ru: Введите комбинацию клавиш, которую следует использовать для действия. Примечание: эта возможность ещё не реализована в Caja-Actions.

source: Id. :
ru: Идентификатор:

source: I/O provider :
ru: Поставщик ввода/вывода:

source: Read-only item
ru: Элемент только для чтения

source: This box is checked if the item cannot be edited. There may be multiple reasons for why an item cannot be edited. See your User's Manual.
ru: Этот флажок установлен, если элемент нельзя изменить. Редактирование элемента может быть запрещено по ряду причин. Более подробные сведения доступны в руководстве пользователя.

source: <b>Read-only properties</b>
ru: <b>Свойства только для чтения</b>

source: This tab lets you edit some miscellaneous properties, and access some non-modifiable information.
ru: На этой вкладке можно изменить некоторые свойства и получить доступ к некоторой неизменяемой информации.

source: P_roperties
ru: _Свойства

source: Caja-Actions actions
ru: Действия Caja-Actions

source: A submenu which embeds the currently available Caja-Actions actions and menus
ru: Подменю, которое содержит текущие доступные действия и меню Caja-Actions

source: About Caja-Actions
ru: О программе Caja-Actions

source: Display some information about Caja-Actions
ru: Показать сведения о программе Caja-Actions

source: The URI of the file to be imported
ru: URI файла, который будет импортирован

source: Output the version number
ru: Показать номер версии

source: Import a file.
ru: Импортировать файл.

source: Bug reports are welcomed at http://bugzilla.gnome.org, or you may prefer to mail to <maintainer@caja-actions.org>.
ru: Отчёт об ошибке можно разместить на сайте http://bugzilla.gnome.org или отправить по адресу <maintainer@caja-actions.org>.

source: Miscellaneous options
ru: Различные параметры

source: Syntax error: %s
ru: Синтаксическая ошибка: %s

source: Error: uri is mandatory.
ru: Ошибка: URI является обязательным.

source: Try %s --help for usage.
ru: Для получения сведений об использовании попробуйте выполнить %s --help.

source: Bug reports are welcomed at https://bugzilla.gnome.org/enter_bug.cgi?product=caja-actions, or you may prefer to mail to <maintainer@caja-actions.org>.
ru: Отчёт об ошибке можно разместить на сайте https://bugzilla.gnome.org/enter_bug.cgi?product=caja-actions, или отправить по адресу <maintainer@caja-actions.org>.

source: The XPath to the tree to be deleted
ru: XPath к дереву, которое будет удалено

source: The filename of the XML backend
ru: Имя файла внутренней службы XML

source: Error: a XPath is mandatory.
ru: Ошибка: XPath является обязательным.

source: Error: a XML filename is mandatory.
ru: Ошибка: имя файла XML является обязательным.

source: Delete a XPath from a XML document.
ru: Удалить XPath из документа XML.

source: Error: unable to parse file '%s'
ru: Ошибка: не удалось провести синтаксический разбор файла «%s»

source: Error: unable to create new XPath context
ru: Ошибка: не удалось создать новый контекст XPath

source: Error: unable to evaluate XPath expression '%s'
ru: Ошибка: не удалось вычислить выражение XPath «%s»

source: Output the schema on stdout
ru: Выводить схему в стандартный вывод (stdout)

source: Output the action schemas [default]
ru: Выводить схемы действий [по умолчанию]

source: Output the menu schemas
ru: Выводить схемы меню

source: Output the Caja-Actions MateConf schemas on stdout.
ru: Выводить схемы MateConf программы Caja-Actions в стандартный вывод (stdout).

source: As of version 3.1.0, MateConf as an I/O provider is deprecated. This program is no more maintained.
ru: Начиная с версии 3.1.0, MateConf не поддерживается в качестве поставщика ввода/вывода. Эта программа больше не поддерживается.

source: Type options
ru: Параметры ввода

source: Set a key=value pair in a key file.
ru: Установить пару key=value в файле ключей.

source: The group to be updated
ru: Группа для обновления

source: The key to be updated
ru: Ключ для обновления

source: The type of the value to be set, may be 'str', 'int' or 'bool'
ru: Тип устанавливаемого значения, допустимые варианты: «str», «int» или «bool»

source: The value to be set
ru: Устанавливаемое значение

source: Output the version number and exit gracefully
ru: Показать номер версии и нормально завершить работу

source: Error: a group is mandatory.
ru: Ошибка: группа является обязательной.

source: Error: a key is mandatory.
ru: Ошибка: ключ является обязательным.

source: Error: a type is mandatory for setting/updating a value.
ru: Ошибка: тип является обязательным для установки/обновления значения.

source: Error: unknown type: %s. Use 'str', 'int' or 'bool'.
ru: Ошибка: неизвестный тип — %s. Используйте «str», «int» или «bool».
