Repository: NiceandGently/caja-actions
Catalog: po/*.po
Languages: ru

source: Error: a value is mandatory.
ru: Ошибка: значение является обязательным.

source: Set it if the item should be disabled at creation
ru: Установите этот параметр, если элемент следует отключить при создании

source: Set it if the item doesn't target the selection context menu
ru: Установите этот параметр, если целью элемента не является контекстное меню выделения

source: Set it if the item doesn't target the location context menu
ru: Установите этот параметр, если целью элемента не является контекстное меню расположения

source: Set it if the item doesn't target the toolbar
ru: Установите этот параметр, если целью элемента не является панель инструментов

source: Set it if the basename patterns are case insensitive
ru: Установите этот параметр, если шаблоны базовых имён нечувствительны к регистру

source: Output the new item content on stdout (default)
ru: Выводить содержимое нового элемента в стандартный вывод (stdout) (по умолчанию)

source: Create the new item as a .desktop file
ru: Создать новый элемент как файл .desktop

source: Error: '%s' and '%s' options cannot both be specified
ru: Ошибка: параметры «%s» и «%s» не могут быть указаны одновременно

source: '%s' option is deprecated, see %s
ru: Параметр «%s» устарел, см. %s

source: Error: an action label is mandatory.
ru: Ошибка: подпись действия является обязательной.

source: Error: only one output option may be specified.
ru: Ошибка: можно указать только один вариант вывода.

source: Define a new action.
ru: Определить новое действие.

source: The created action defaults to be written to stdout. It can also be written to an output folder, in a file later suitable for an import in CACT. Or you may choose to directly write the action into your Caja-Actions configuration.
ru: По умолчанию созданное действие будет записано в стандартный вывод. Кроме того, его можно записать в выходную папку в виде файла, который в дальнейшем можно будет импортировать в программу для настройки Caja-Actions. Либо вы можете напрямую записать действие в вашу конфигурацию Caja-Actions.

source: Output of the program
ru: Вывод программы

source: Choose where the program creates the action
ru: Выбрать, где программа создаёт действие

source: Error: unable to find 'na-desktop' i/o provider.
ru: Ошибка: не удалось найти поставщика ввода/вывода «na-desktop».

source: Print a menu or an action to stdout.
ru: Выводить меню или действие в стандартный вывод (stdout).

source: The identifiant of the menu or the action to be printed
ru: Идентификатор меню или действия, которое будет выведено

source: An export format [Desktop1]
ru: Формат экспорта [РабочийСтол1]

source: Error: a menu or action id is mandatory.
ru: Ошибка: идентификатор меню или действия является обязательным.

source: Error: %s: unknown export format.
ru: Ошибка: %s — неизвестный формат экспорта.

source: Error: item '%s' doesn't exist.
ru: Ошибка: элемент «%s» не существует.

source: The internal identifier of the action to be launched
ru: Внутренний идентификатор действия, которое будет запущено

source: A target, file or folder, for the action. More than one options may be specified
ru: Цель, файл или папка, для действия. Можно указать несколько вариантов

source: Error: action id is mandatory.
ru: Ошибка: идентификатор действия является обязательным.

source: No current selection. Nothing to do. Exiting.
ru: Нет текущего выделения. Нет заданий для выполнения. Выполняется выход.

source: Action %s is not a valid candidate. Exiting.
ru: Действие %s не является корректным кандидатом. Выполняется выход.

source: No valid profile is candidate to execution. Exiting.
ru: Нет корректного профиля в качестве кандидата на выполнение. Выполняется выход.

source: Execute an action on the specified target.
ru: Выполнить действие над указанной целью.

source: Error: action '%s' doesn't exist.
ru: Ошибка: действие «%s» не существует.

source: Error: action '%s' is disabled.
ru: Ошибка: действие «%s» отключено.

source: Error: action '%s' is not valid.
ru: Ошибка: действие «%s» не является корректным.

source: Error: unable to get a connection to session DBus: %s
ru: Ошибка: не удалось установить соединение с сеансом DBus — %s

source: Error: unable to get a proxy on %s service
ru: Ошибка: не удалось получить прокси-сервер для службы %s

source: Error on GetSelectedPaths call: %s
ru: Ошибка при вызове GetSelectedPaths: %s
