Repository: NiceandGently/caja-actions
Catalog: po/*.po
Languages: ru

source: Ask for a confirmation when quitting by Esc
ru: Запрашивать подтверждение при выходе по нажатию Esc

source: If TRUE, a confirmation will be requested when quitting an assistant by hitting the Esc key.
ru: Если включено, при выходе из помощника по нажатию клавиши Esc будет запрашиваться подтверждение.

source: Whether the Esc key should close the assistants
ru: Должны ли помощники закрываться по нажатию Esc

source: If TRUE, assistant may be closed by hitting the Esc key.
ru: Если включено, помощник можно закрыть нажатием клавиши Esc.

source: Whether the auto-save feature should be activated
ru: Следует ли включить функцию автосохранения

source: If TRUE, the pending modifications will be periodically and automatically saved.
ru: Если включено, изменения будут периодически автоматически сохраняться.

source: Periodicity of the auto-save
ru: Периодичность автосохранения

source: Defines the periodicity in minutes of the automatic save.
ru: Определяет периодичность (в минутах) автоматического сохранения.

source: Position and size of the export assistant window
ru: Положение и размер окна помощника экспорта

source: Position and size of the export assistant window ; default is set by the window manager.
ru: Положение и размер окна помощника экспорта; значение по умолчанию задаётся диспетчером окон.

source: Last selected folder
ru: Последняя выбранная папка

source: Last folder selected when choosing a folder where to export the actions.
ru: Последняя папка, выбранная в качестве места, в которое будут экспортированы действия.

source: Preferred export format
ru: Предпочтительный формат экспорта

source: This is the preferred export format, used as a default when exporting items, or dropping them outside of the application. Possible values are: - "MateConfSchemaV1": this used to be the historical export format. The exported file may later be imported via Import assistant of the Caja-Actions Configuration Tool, or via the mateconftool-2 --import-schema-file command-line tool. - "MateConfSchemaV2": a lighter while still compatible schema. The exported file may later be imported via Import assistant of the Caja-Actions Configuration Tool, or via the mateconftool-2 --import-schema-file command-line tool. - "MateConfEntry": this should be the preferred format for newly exported actions. The exported file may later be imported via Import assistant of the Caja-Actions Configuration Tool, or via the mateconftool-2 --load command-line tool. - "Ask": the user will be asked at runtime for the format he wishes use.
ru: Это предпочтительный формат экспорта, который используется по умолчанию при экспорте элементов или их перемещении за пределы окна приложения. Возможные значения: - «MateConfSchemaV1»: исторически использовавшийся формат экспорта. Экспортированный файл затем можно импортировать с помощью помощника импорта программы для настройки Caja-Actions или с помощью средства командной строки mateconftool-2 --import-schema-file. - «MateConfSchemaV2»: более легковесная, но также обеспечивающая совместимость схема. Экспортированный файл затем можно импортировать с помощью помощника импорта программы для настройки Caja-Actions или с помощью средства командной строки mateconftool-2 --import-schema-file. - «MateConfEntry»: рекомендуемый формат для новых экспортируемых действий. Экспортированный файл затем можно импортировать с помощью помощника импорта программы для настройки Caja-Actions или с помощью средства командной строки mateconftool-2 --load. - «Ask»: пользователю будет предложено выбрать формат, который следует использовать.

source: Position and size of the command chooser window
ru: Положение и размер окна выбора команды

source: Position and size of the command chooser window in the Command tab ; default is set by the window manager.
ru: Положение и размер окна выбора команды на вкладке «Команда»; значение по умолчанию задаётся диспетчером окон.

source: Last folder selected when browsing for a command in the Command tab.
ru: Последняя папка, выбранная при поиске команды на вкладке «Команда».

source: Position and size of the Legend dialog
ru: Положение и размер диалогового окна «Легенда»

source: Position and size of the Legend dialog ; default is set by the UI manager.
ru: Положение и размер диалогового окна «Легенда»; значение по умолчанию задаётся диспетчером интерфейса пользователя.

source: Position and size of the URI chooser window
ru: Положение и размер окна выбора URI

source: Position and size of the URI chooser window in the Folders tab ; default is set by the window manager.
ru: Положение и размер окна выбора URI на вкладке «Папки»; значение по умолчанию задаётся диспетчером окон.

source: Last folder selected when browsing for an URI in the Folders tab.
ru: Последняя папка, выбранная на вкладке «Папки» при поиске URI.

source: Position and size of the interaction dialog at import time
ru: Положение и размер интерактивного диалога при импорте

source: Position and size of the interaction dialog at import time ; default is set by the window manager.
ru: Положение и размер интерактивного диалога при импорте; значение по умолчанию задаётся диспетчером окон.

source: Last import mode chosen by the user
ru: Последний режим импорта, выбранный пользователем

source: Last import mode chosen by the user when he is asked for in import mode. Possible values are: - "NoImport": do not import an action whose UUID already exists, - "Renumber": allocate a new UUID if the imported UUID already exists, - "Override": override the existing action with the imported one.
ru: Последний режим импорта, выбранный пользователем при ответе на соответствующий запрос. Возможные значения: - «NoImport»: не импортировать действие, UUID которого уже существует, - «Renumber»: выделить новый UUID, если импортируемый UUID уже существует, - «Override»: заменить существующее действие импортируемым.

source: Position and size of the import assistant window
ru: Положение и размер окна помощника импорта

source: Position and size of the import assistant window ; default is set by the window manager.
ru: Положение и размер окна помощника импорта; значение по умолчанию задаётся диспетчером окон.

source: Last folder selected when choosing a folder from where import new actions.
ru: Последняя папка, выбранная в качестве места, из которого будут импортированы новые действия.

source: Keep last chosen import mode
ru: Сохранять последний выбранный режим импорта

source: Whether the import system should reuse the last chosen import mode.
ru: Следует ли системе импорта повторно использовать последний выбранный режим импорта.

source: Import mode
ru: Режим импорта

source: Last import mode chosen in the Import assistant. Possible values are : - "NoImport": do not import an action whose UUID already exists, - "Renumber": allocate a new UUID if the imported UUID already exists, - "Override": override the existing action with the imported one, - "Ask": ask the user each time.
ru: Последний режим импорта, выбранный в помощнике импорта. Возможные значения: - «NoImport»: не импортировать действие, UUID которого уже существует, - «Renumber»: выделить новый UUID, если импортируемый UUID уже существует, - «Override»: заменить существующее действие импортируемым, - «Ask»: пользователю будет предложено выбрать режим импорта, который следует использовать.

source: I/O providers Write priority
ru: Приоритет записи поставщиков ввода/вывода

source: The order in which I/O providers are tested when we need to write a new item down to a storage subsystem.
ru: Порядок, в котором проверяются поставщики ввода/вывода, когда требуется записать новый элемент в подсистему хранения.

source: Add an 'About' item in the Caja context menu
ru: Добавить пункт «О программе» в контекстное меню Caja

source: If TRUE, and if the user has defined a single root menu for its actions, then an 'About Caja-Actions' will be displayed at end of the first submenu.
ru: Если этот параметр включён и пользователь определил единое корневое меню для действий, в конце первого подменю будет показан пункт «О программе Caja-Actions».

source: Sort mode
ru: Режим сортировки

source: This preference indicates the preferred sort mode. Possible values are : - "AscendingOrder": the actions are maintained in ascending alphabetical order (historical behavior). - "DescendingOrder": the actions are maintained in descending alphabetical order. - "ManualOrder": user is free to reorder them via Caja-Actions configuration tool.
ru: Этот параметр определяет предпочтительный режим сортировки. Возможные значения: - «AscendingOrder»: действия располагаются по алфавиту в порядке возрастания (используется исторически). - «DescendingOrder»: действия располагаются по алфавиту в порядке убывания. - «ManualOrder»: пользователь может изменять порядок действий с помощью программы для настройки Caja-Actions.

source: Define a 'Caja-Actions actions' root menu
ru: Определить корневое меню «Действия Caja-Actions»

source: If TRUE, then a 'Caja-Actions actions' item will be defined in the Caja context menu, and will be the root menu of all available actions.
ru: Если включено, в контекстном меню Caja будет определён элемент «Действия Caja-Actions», являющийся корневым меню всех доступных действий.

source: List of items at first level of the hierarchy
ru: Список действий на первом уровне иерархии

source: UUID of the items at the first level of the hierarchy. If this key is not found or empty, then all found items are considered as a flat list.
ru: UUID действий на первом уровне иерархии. Если этот ключ не найден или пуст, все найденные действия считаются неструктурированным списком.

source: Whether actions should be relabeled when pasted or duplicated
ru: Следует ли изменять подписи действий при вставке или дублировании

source: Whether actions should be relabeled when pasted or duplicated.
ru: Следует ли изменять подписи действий при вставке или дублировании.

source: Whether menus should be relabeled when pasted or duplicated
ru: Следует ли изменять подписи меню при вставке или дублировании

source: Whether menus should be relabeled when pasted or duplicated.
ru: Следует ли изменять подписи меню при вставке или дублировании.

source: Whether profiles should be relabeled when pasted or duplicated
ru: Следует ли изменять подписи профилей при вставке или дублировании

source: Whether profiles should be relabeled when pasted or duplicated.
ru: Следует ли изменять подписи профилей при вставке или дублировании.

source: Display Edit toolbar
ru: Показать панель инструментов «Правка»

source: Whether to display or not the Edit toolbar in the main window.
ru: Следует ли показывать панель инструментов «Правка» в главном окне.

source: Display File toolbar
ru: Показать панель инструментов «Файл»

source: Whether to display or not the File toolbar in the main window.
ru: Следует ли показывать панель инструментов «Файл» в главном окне.

source: Display Help toolbar
ru: Показать панель инструментов «Справка»

source: Whether to display or not the Help toolbar in the main window.
ru: Следует ли показывать панель инструментов «Справка» в главном окне.

source: Main pane position
ru: Положение главной панели

source: Width of the main window pane ; default is set by the UI manager.
ru: Ширина главной панели окна; значение по умолчанию задаётся диспетчером интерфейса пользователя.

source: Display Tools toolbar
ru: Показать панель инструментов «Сервис»

source: Whether to display or not the Tools toolbar in the main window.
ru: Следует ли показывать панель инструментов «Сервис» в главном окне.

source: Position and size of the main window
ru: Положение и размер главного окна

source: Position and size of the main window ; default is set by the window manager.
ru: Положение и размер главного окна; значение по умолчанию задаётся диспетчером окон.

source: Position and size of the preferences dialog
ru: Положение и размер диалогового окна параметров

source: Position and size of the preferences dialog ; default is set by the window manager.
ru: Положение и размер диалогового окна параметров; значение по умолчанию задаётся диспетчером окон.

source: List of default schemes
ru: Список схем по умолчанию

source: The list of schemes proposed by default on each new profile. A default default list is harcoded in caja-actions-config-tool, which may be updated by the user.
ru: Список схем, которые предлагаются по умолчанию в каждом новом профиле. Список по умолчанию жёстко закодирован в caja-actions-config-tool, но может быть обновлён пользователем.

source: Whether the whole configuration is locked
ru: Заблокирована ли вся конфигурация целиком

source: The whole configuration must be understood here as the global set and order of menus and actions. When this configuration is locked, then the user is no more able to modify nor create or delete any menu or action. All items are read-only. As the order of items is also locked, the level zero itself cannot be modified, and the user is unable to reorder the items.
ru: Под «всей конфигурацией» здесь следует понимать глобальный набор и порядок меню и действий. При блокировке конфигурации пользователь больше не может изменять, создавать или удалять меню или действия. Все элементы находятся в режиме «только чтение». Так как порядок элементов также заблокирован, сам нулевой уровень нельзя изменить; пользователь не может изменить порядок элементов.

source: Whether the MateConf I/O provider is locked
ru: Заблокирован ли поставщик ввода/вывода MateConf

source: When set to true (most probably as a mandatory key), this prevents all items, menus and actions, read from MateConf to being modified in CACT.
ru: Если этот параметр отмечен (вероятнее всего, в качестве обязательного ключа), все элементы, меню и действия, прочитанные из MateConf, не могут быть изменены в программе для настройки Caja-Actions.

source: Whether the Desktop I/O provider is locked
ru: Заблокирован ли поставщик ввода/вывода файлов .desktop

source: When set to true (most probably as a mandatory key), this prevents all items, menus and actions, read from .desktop files to being modified in CACT.
ru: Если этот параметр отмечен (вероятнее всего, в качестве обязательного ключа), все элементы, меню и действия, прочитанные из файлов .desktop, не могут быть изменены в программе для настройки Caja-Actions.

source: _Ask me
ru: _Спрашивать

source: You will be asked for the format to choose each time an item is about to be exported.
ru: Вам будет предложено выбрать формат, который следует использовать, при каждом экспорте элемента.

source: No NAIExporter implementation found for '%s' format.
ru: Реализация NAIExporter не найдена для формата «%s».

source: %s NAIExporter doesn't implement 'to_buffer' interface.
ru: %s NAIExporter не реализует интерфейс «to_buffer».

source: %s NAIExporter doesn't implement 'to_file' interface.
ru: %s NAIExporter не реализует интерфейс «to_file».

source: Caja-Actions Configuration Tool is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
ru: Программа для настройки Caja-Actions является свободным программным обеспечением; вы можете распространять и/или изменять его согласно условиям стандартной общественной лицензии GNU (GNU GPL), опубликованной Фондом свободного программного обеспечения (FSF); либо лицензии версии 2, либо (на ваше усмотрение) любой более поздней версии.

source: Caja-Actions Configuration Tool is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
ru: Программа настройки Caja-Actions распространяется в надежде, что она будет полезной, но БЕЗ КАКИХ БЫ ТО НИ БЫЛО ГАРАНТИЙНЫХ ОБЯЗАТЕЛЬСТВ; даже без косвенных гарантийных обязательств, связанных с ПОТРЕБИТЕЛЬСКИМИ СВОЙСТВАМИ и ПРИГОДНОСТЬЮ ДЛЯ ОПРЕДЕЛЕННЫХ ЦЕЛЕЙ. Подробности читайте в стандартной общественной лицензии GNU.

source: You should have received a copy of the GNU General Public License along with Caja-Actions Configuration Tool ; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.
ru: Вы должны были получить копию стандартной общественной лицензии GNU вместе с программой настройки Caja-Actions. Если это не так, напишите по адресу Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.

source: A graphical interface to create and edit your Caja actions.
ru: Графический интерфейс для создания и изменения действий Caja.

source: The GNOME Translation Project <gnome-i18n@gnome.org>
ru: Проект перевода GNOME <gnome-i18n@gnome.org>

source: Copyright %s 2005 The GNOME Foundation Copyright %s 2006-2008 Frederic Ruaudel <grumz@grumz.net> Copyright %s 2009-2012 Pierre Wieser <pwieser@trychlos.org>
ru: Авторское право %s Фонд GNOME, 2005 Авторское право %s Frederic Ruaudel, 2006—2008 <grumz@grumz.net> Авторское право %s Pierre Wieser, 2009—2012 <pwieser@trychlos.org>

source: MATE desktop
ru: Рабочий стол MATE

source: KDE desktop
ru: Рабочий стол KDE

source: LXDE desktop
ru: Рабочий стол LXDE

source: ROX desktop
ru: Рабочий стол ROX

source: XFCE desktop
ru: Рабочий стол XFCE

source: Legacy systems
ru: Устаревшие системы

source: List of patterns to be matched against the selected file(s)/folder(s)
ru: Список шаблонов для выбора файлов/папок

source: A list of strings with joker '*' or '?' to be matched against the name(s) of the selected file(s)/folder(s). Each selected item must match at least one of the filename patterns for the action or the menu be candidate to display. This obviously only applies when there is a selection. Defaults to '*'.
ru: Список строк с шаблоном «*» или «?» для выбора файлов/папок по названиям. Каждый выбранный элемент должен соответствовать хотя бы одному из шаблонов, чтобы действие или меню стало кандидатом на отображение. Применяется только при наличии выделения. По умолчанию — «*».

source: A pattern to be matched against basenames of selected file(s)/folder(s). May include wildcards (* or ?). You must set one option for each pattern you need
ru: Шаблон для выбора файлов/папок по базовым именам. Может включать подстановочные знаки («*» или «?»). Укажите один вариант для каждого шаблона, который будет использоваться.

source: <EXPR>
ru: <ВЫРАЖЕНИЕ>

source: Whether the specified basenames are case sensitive (default)
ru: Чувствительны ли к регистру указанные базовые имена (по умолчанию)

source: Must be set to 'true' if the filename patterns are case sensitive, to 'false' otherwise. E.g., if you need to match a filename in a case-sensitive manner, set this key to 'true'. If you also want, for example '*.jpg' to match 'photo.JPG', then set 'false'. This obviously only applies when there is a selection. Defaults to 'true'.
ru: Если необходимо, чтобы выбор файлов или папок по названиям производился с учётом регистра, укажите значением аргумента «true». В противном случае используйте «false». Например, если по запросу «*.jpg» должен появляться файл «photo.JPG», установите значение «false». Применяется только при наличии выделения. По умолчанию — «true».

source: List of patterns to be matched against the mimetypes of the selected file(s)/folder(s)
ru: Список шаблонов для выбора файлов/папок по типам MIME

source: A list of strings with joker '*' to be matched against the mimetypes of the selected file(s)/folder(s). Each selected item must match at least one of the mimetype patterns for the action to appear. This obviously only applies when there is a selection. Defaults to '*/*'.
ru: Список строк с шаблоном «*» или «?» для выбора файлов/папок по типам MIME. Каждый выбранный элемент должен соответствовать хотя бы одному из шаблонов типов MIME, чтобы действие было показано. Применяется только при наличии выделения. По умолчанию — «*/*».

source: A pattern to be matched against mimetypes of selected file(s)/folder(s). May include the asterisk wildcard '*'. You must set one option for each pattern you need
ru: Шаблон для выбора файлов/папок по типам MIME. Может включать подстановочный знак «*».Укажите один вариант для каждого шаблона, который будет использоваться.

source: Whether the profile applies to files (deprecated option, see mimetype)
ru: Применяется ли профиль к файлам (устаревший параметр, см. параметр типов MIME)

source: Set to 'true' if the selection can have files, to 'false' otherwise. This setting is tied in with the 'isdir' setting. The valid combinations are: isfile='true' and isdir='false': the selection may hold only files isfile='false' and isdir='true': the selection may hold only folders isfile='true' and isdir='true': the selection may hold both files and folders isfile='false' and isdir='false': this is an invalid combination (your configuration will never appear). This obviously only applies when there is a selection. Defaults to 'true'.
ru: Установите значение «true», чтобы в выделении могли находиться файлы.Если это следует запретить, установите значение «false». Этот параметр связан с параметром «isdir». Корректными комбинациями являются: isfile=TRUE и isdir=FALSE: в выделении могут находиться только файлы isfile=FALSE и isdir=TRUE: в выделении могут находиться только папки isfile=TRUE и isdir=TRUE: в выделении могут находиться и файлы, и папки isfile=FALSE и isdir=FALSE: это некорректная комбинация (настроенная схема не будет показана). Применяется только при наличии выделения. По умолчанию — «true».

source: Whether the profile applies to folders (deprecated option, see mimetype)
ru: Применяется ли профиль к папкам (устаревший параметр, см. параметр типов MIME)

source: Set to 'true' if the selection can have folders, to 'false' otherwise. This setting is tied in with the 'isfile' setting. The valid combinations are: isfile='true' and isdir='false': the selection may hold only files isfile='false' and isdir='true': the selection may hold only folders isfile='true' and isdir='true': the selection may hold both files and folders isfile='false' and isdir='false': this is an invalid combination (your configuration will never appear). This obviously only applies when there is a selection. Defaults to 'false'.
ru: Установите значение «true», чтобы в выделении могли находиться папки.Если это следует запретить, установите значение «false». Этот параметр связан с параметром «isfile». Корректными комбинациями являются: isfile=TRUE и isdir=FALSE: в выделении могут находиться только файлы isfile=FALSE и isdir=TRUE: в выделении могут находиться только папки isfile=TRUE и isdir=TRUE': в выделении могут находиться и файлы, и папки isfile=FALSE и isdir=FALSE: это некорректная комбинация (настроенная схема не будет показана). Применяется только при наличии выделения. По умолчанию — «false».

source: Whether the selection may be multiple (deprecated option, see selection count)
ru: Может ли выделение включать несколько элементов (устаревший параметр, см. параметр количества элементов в выделении)

source: If you need more than one files or folders to be selected, set this key to 'true'. If you want just one file or folder, set it to 'false'. This obviously only applies when there is a selection. Defaults to 'false'.
ru: Если необходимо, чтобы было выбрано несколько файлов или папок, укажите значением аргумента «true». Если необходимо выбрать только один файл или папку, используйте «false». Применяется только при наличии выделения. По умолчанию — «false».

source: List of schemes to be matched against those of selected file(s)/folder(s)
ru: Список схем для сравнения со схемами выбранных файлов/папок
