Repository: NiceandGently/caja-actions
Catalog: po/*.po
Languages: ru

source: _Toolbars
ru: _Панели инструментов

source: _Tools
ru: _Сервис

source: _Maintainer
ru: _Сопровождающий

source: _Help
ru: _Справка

source: Notebook _tabs
ru: _Закладки

source: New _menu
ru: Новое _меню

source: Insert a new menu at the current position
ru: Вставить новое меню в текущем месте

source: _New action
ru: _Новое действие

source: Define a new action
ru: Определить новое действие

source: New _profile
ru: Новый _профиль

source: Define a new profile attached to the current action
ru: Определить новый профиль, связанный с текущим действием

source: Record all the modified actions. Invalid actions will be silently ignored
ru: Записывать все изменённые действия. Некорректные действия будут игнорироваться без уведомлений

source: Quit the application
ru: Выйти из приложения

source: Cut the selected item(s) to the clipboard
ru: Вырезать выбранные элементы в буфер обмена

source: Copy the selected item(s) to the clipboard
ru: Копировать выбранные элементы в буфер обмена

source: Insert the content of the clipboard just before the current position
ru: Вставить содержимое буфера обмена непосредственно перед текущим местом

source: Paste _into
ru: Вставить _в

source: Insert the content of the clipboard as first child of the current item
ru: Вставить содержимое буфера обмена как первого потомка текущего элемента

source: D_uplicate
ru: Д_ублировать

source: Duplicate the selected item(s)
ru: Дублировать выбранные элементы

source: Delete the selected item(s)
ru: Удалить выбранные элементы

source: _Reload the items
ru: _Перезагрузить элементы

source: Cancel your current modifications and reload the initial list of menus and actions
ru: Отменить текущие изменения и перезагрузить исходный список меню и действий

source: Edit your preferences
ru: Изменить ваши параметры

source: _Expand all
ru: _Развернуть все

source: Entirely expand the items hierarchy
ru: Полностью развернуть иерархию элементов

source: _Collapse all
ru: _Свернуть все

source: Entirely collapse the items hierarchy
ru: Полностью свернуть иерархию элементов

source: _Import assistant...
ru: Помощник _импорта...

source: Import one or more actions from external files into your configuration
ru: Импортировать одно или несколько действий из внешних файлов в вашу конфигурацию

source: E_xport assistant...
ru: Помощник _экспорта...

source: Export one or more actions from your configuration to external files
ru: Экспортировать одно или несколько действий из вашей конфигурации во внешние файлы

source: _Dump the selection
ru: Создать _дамп выделения

source: Recursively dump selected items
ru: Рекурсивный дамп выбранных элементов

source: _Brief tree store dump
ru: _Быстрый дамп хранилища деревьев

source: Briefly dump the tree store
ru: Быстрый дамп хранилища деревьев

source: _List modified items
ru: _Список изменённых элементов

source: List the modified items
ru: Список изменённых элементов

source: _Dump the clipboard
ru: _Дамп буфера обмена

source: Dump the content of the clipboard object
ru: Дамп содержимого объекта буфера обмена

source: Contents
ru: Содержимое

source: Display help about this program
ru: Показать справку для этой программы

source: Display information about this program
ru: Показать сведения об этой программе

source: Display the File toolbar
ru: Показать панель инструментов «Файл»

source: Display the Edit toolbar
ru: Показать панель инструментов «Правка»

source: Display the Tools toolbar
ru: Показать панель инструментов «Сервис»

source: Display the Help toolbar
ru: Показать панель инструментов «Справка»

source: On the _left
ru: С_лева

source: Display the notebook tabs on the left side
ru: Показать закладки слева

source: On the _right
ru: С_права

source: Display the notebook tabs on the right side
ru: Показать закладки справа

source: On the _top
ru: С_верху

source: Display the notebook tabs on the top side
ru: Показать закладки сверху

source: On the _bottom
ru: С_низу

source: Display the notebook tabs on the bottom side
ru: Показать закладки снизу

source: %d menu(s), %d action(s), %d profile(s) are currently loaded
ru: Сейчас загружено: меню — %d, действий — %d, профилей — %d

source: Not all items have been cut as following ones are not modifiable:
ru: Были вырезаны не все элементы, так как следующие элементы являются неизменяемыми:

source: Not all items have been deleted as following ones are not modifiable:
ru: Были удалены не все элементы, так как следующие элементы являются неизменяемыми:

source: Save error
ru: Ошибка сохранения

source: Some items may not have been saved
ru: Возможно, некоторые элементы не были сохранены

source: Unable to rewrite the level-zero items list
ru: Не удалось перезаписать список элементов нулевого уровня

source: Some items have not been deleted
ru: Некоторые элементы не были удалены

source: New profile
ru: Новый профиль

source: Automatically saving pending modifications...
ru: Автоматическое сохранение ожидающих изменений...

source: Caja-Actions Preferences
ru: Параметры Caja-Actions

source: _Ascending alphabetical order
ru: _По алфавиту в порядке возрастания

source: Menus and actions will be displayed in the ascending alphabetical order of their label, both in the Caja context menu and in the CACT user interface.
ru: Меню и действия будут показаны по алфавиту, в порядке возрастания соответствующих подписей (как в контекстном меню Caja, так и интерфейсе пользователя программы для настройки Caja-Actions).

source: _Descending alphabetical order
ru: _По алфавиту в порядке убывания

source: Menus and actions will be displayed in the descending alphabetical order of their label, both in the Caja context menu and in the CACT user interface.
ru: Меню и действия будут показаны по алфавиту, в порядке убывания соответствующих подписей (как в контекстном меню Caja, так и интерфейсе пользователя программы для настройки Caja-Actions).

source: _Manual order
ru: _Вручную

source: Display order of menus and actions, both in the Caja context menu and in the CACT user interface, must be manually adjusted.
ru: Порядок отображения меню и действий (как в контекстном меню Caja, так и интерфейсе пользователя программы для настройки Caja-Actions) должен настраиваться вручную.

source: <b>Items ordering</b>
ru: <b>Упорядочение элементов</b>

source: _Create a root 'Caja-Actions' menu
ru: _Создать корневое меню «Caja-Actions»

source: When this option is checked, menus and actions will actually be displayed as sub-items of a root 'Caja-Actions' menu in the Caja context menu.
ru: Если этот параметр отмечен, меню и действия будут отображаться как подэлементы корневого меню «Caja-Actions» в контекстном меню Caja.

source: Add an 'A_bout Caja-Actions' item in the Caja context menus
ru: Добавить пункт «_О программе Caja-Actions» в контекстное меню Caja

source: When this option is checked, an 'About Caja-Actions' item will be added to the root Caja-Actions menu in the Caja context menu. Note that this item will be displayed only if a unique menu is defined in the Caja context menu (e.g. when having checked the root 'Caja-Actions' menu option above).
ru: Если этот параметр отмечен, в корневое меню Caja-Actions в контекстном меню Caja будет добавлен пункт «О программе Caja-Actions».Обратите внимание, что этот элемент будет отображаться только в том случае, если в контекстном меню Caja определено уникальное меню (например, когда отмечен приведённый выше параметр корневого меню «Caja-Actions»).

source: <b>Caja menu layout</b>
ru: <b>Конфигурация меню Caja</b>

source: This tab lets you choose how the actions are ordered in the displayed list as well as in the Caja context menu. You may also choose here how actions will be displayed in the Caja context menu.
ru: На этой вкладке можно настроить порядок действий в отображаемом списке, а также в контекстном меню Caja. Вы также можете выбрать, как действия будут отображаться в контекстном меню Caja.

source: _Runtime preferences
ru: _Параметры среды выполнения

source: Specify here the command to run and keep opened a terminal. This command should include a 'COMMAND' keyword, which will be substituted at runtime with the action path and parameters.
ru: Укажите здесь команду для запуска. Терминал должен оставаться открытым. Эта команда должна включать ключевое слово «COMMAND», которое во время выполнения будет заменено путём к действию и его параметрами.

source: _Command pattern :
ru: _Шаблон команды:

source: <b>Execution in a terminal</b>
ru: <b>Выполнение в терминале</b>

source: Running _desktop environment :
ru: Запущенная _среда рабочего стола:

source: <i>Currently detected :</i>
ru: <i>Определённое значение среды:</i>

source: <b>Desktop environment</b>
ru: <b>Среда рабочего стола</b>

source: This tab lets you specify parameters needed for. some execution modes.
ru: На этой вкладке можно указать параметры, которые требуются для некоторых режимов выполнения.

source: Runtime E_xecution
ru: Исполнение при _выполнении

source: What to do when pasting or duplicating an item in the tree ?
ru: Что следует предпринять при вставке или дублировании элемента в дереве?

source: Relabel _menus
ru: Изменять подписи _меню

source: When a menu is copied/pasted, or duplicated, the new menu will be relabelled as 'Copy of ...'.
ru: При копировании/вставке меню или его дублировании новое меню получит подпись «Копия ...».

source: Relabel _actions
ru: Изменять подписи _действий

source: When an action is copied/pasted, or duplicated, the new action will be relabelled as 'Copy of ...'.
ru: При копировании/вставке действия или его дублировании новое действие получит подпись «Копия ...».

source: Relabel _profiles
ru: Изменять подписи _профилей

source: When a profile is copied/pasted, or duplicated, the new profile will be relabelled as 'Copy of ...'.
ru: При копировании/вставке профиля или его дублировании новый профиль получит подпись «Копия ...».

source: <b>Relabeling items</b>
ru: <b>Изменение подписей элементов</b>

source: Esc key _quits the assistant
ru: _Выход из помощника по клавише Esc

source: When this option is checked, the 'Escape' key will let you quit the current assistant. Else, quitting the assistant is only possible by hitting the 'Cancel' button.
ru: Если этот параметр отмечен, по нажатию клавиши Escape будет можно выйти из текущего помощника. Если нет — выход возможен только по нажатию кнопки «Отмена».

source: Ask for a _confirmation when quitting the assistant on Esc key
ru: Запросить _подтверждение при выходе из помощника по клавише Esc

source: This option is only relevant when the 'Escape' key lets the user quit the assistant. When checked, the user will be prompted for a confirmation in order to help prevent erroneous hits of the Esc key.
ru: Этот параметр применим только тогда, когда возможен выход из помощника по нажатию клавиши Escape. Если этот параметр отмечен, пользователю будет предложено подтвердить выход (для защиты от случайных нажатий клавиши Esc).

source: <b>Assistants</b>
ru: <b>Помощники</b>

source: Automatically _saves pending modifications
ru: Автоматически _сохранять ожидающие изменения

source: When this option is checked, pending modification will be periodically and automatically saved.
ru: Если этот параметр отмечен, ожидающие изменения будут периодически автоматически сохраняться.

source: Periodicity :
ru: Периодичность:

source: minutes
ru: мин.

source: <b>Auto-save</b>
ru: <b>Автосохранение</b>

source: This tab allows the user to choose custom preferences for the Caja-Actions Configuration Tool user interface.
ru: На этой вкладке пользователь может выбрать пользовательские параметры интерфейса пользователя программы для настройки Caja-Actions.

source: _UI Preferences
ru: Параметры _UI

source: What to do when an item, action or menu, selected to be imported, has the same identifier that a currently existing one ?
ru: Что следует предпринять, когда выбранный для импорта элемент, действие или меню, имеет тот же идентификатор, что и существующий?

source: <b>Import mode</b>
ru: <b>Режим импорта</b>

source: This tab lets you decide on the default behavior of import operations.
ru: На этой вкладке можно установить поведение по умолчанию для операций импорта.

source: _Import
ru: _Импорт

source: What is your preferred export format ?
ru: Какой формат экспорта следует использовать?

source: <b>Export format</b>
ru: <b>Формат экспорта</b>

source: This tab lets you decide on the default behavior of export operations.
ru: На этой вкладке можно установить поведение по умолчанию для операций экспорта.

source: _Export
ru: _Экспорт

source: You may define here any number of schemes. They will be proposed as default schemes when defining conditions for an action. If the list becomes empty, CACT will automatically refill in with this default list. You can add a new scheme by clicking on the '+' button.
ru: Здесь можно определить любое количество схем. Они будут предлагаться в качестве схем по умолчанию при определении условий для действия. Если список будет пуст, программа для настройки Caja-Actions автоматически подставит этот список по умолчанию. Чтобы добавить новую схему, нажмите кнопку «+».

source: Click to add a new default scheme.
ru: Нажмите для добавления новой схемы по умолчанию.

source: Click to remove the selected default scheme.
ru: Нажмите для удаления выбранной схемы по умолчанию.

source: <b>Default schemes</b>
ru: <b>Схемы по умолчанию</b>

source: This tab lets you decide which schemes are proposed by default when editing advanced conditions for an item.
ru: На этой вкладке можно задать, какие схемы предлагаются по умолчанию при редактировании расширенных условий для элемента.

source: _Schemes
ru: _Схемы

source: Define here, for available I/O providers, if you want them to be read at startup, to be writable, and the order in which they will be tested when trying to write a new menu or action.
ru: Здесь можно указать, следует ли выполнять чтение поставщиков ввода/вывода при запуске, сделать ли их доступными для записи, а также порядок, в котором они будут проверяться при попытке записи нового меню или действия.

source: _Up
ru: _Выше

source: Move up the selected I/O provider in the order of priority when trying to write a new item.
ru: Повысить приоритет выбранного поставщика ввода/вывода при попытке записи нового элемента.

source: _Down
ru: _Ниже

source: <b>Activation and priority</b>
ru: <b>Активация и приоритет</b>

source: This tab lets you decide whether the I/O providers are enabled or not, and in which order they will be tried when writing a new item.
ru: На этой вкладке можно указать, следует ли включить поставщиков ввода/вывода, а также порядок, в котором они будут проверяться при записи нового элемента.

source: I/O _Providers
ru: _Поставщики ввода/вывода

source: Rely on runtime detection
ru: Применять значение среды, определённое во время выполнения

source: Ex.:
ru: Пример:

source: Readable
ru: Чтение

source: Writable
ru: Запись

source: I/O Provider
ru: Поставщик ввода/вывода

source: no name
ru: без имени

source: unavailable I/O provider
ru: недоступный поставщик ввода/вывода

source: Keyword
ru: Ключевое слово

source: Local files
ru: Локальные файлы

source: SSH files
ru: Файлы, доступные через SSH-соединение

source: Windows files
ru: Файлы в Windows-сети

source: FTP files
ru: Файлы в FTP-каталоге

source: WebDAV files
ru: Файлы, доступные через WebDAV-соединение

source: %s (already used)
ru: %s (уже используется)

source: new-scheme
ru: новая-схема

source: New scheme description
ru: Описание новой схемы

source: A pointer (not a reference) to the BaseWindow parent of the embedding treeview
ru: Указатель (не ссылка) на родительское BaseWindow встраивающегося древовидного представления

source: Embedding GtkTreeView
ru: Встраивание виджета GtkTreeView

source: The GtkTreeView which relies on this CactTreeModel
ru: Виджет GtkTreeView, который зависит от CactTreeModel

source: Edition mode
ru: Режим редактирования

source: Edition vs. Selection mode
ru: Режим редактирования или режим выделения

source: Unable to drop a profile here
ru: Не удалось выполнить перетаскивание профиля

source: Unable to drop an action or a menu here
ru: Не удалось выполнить перетаскивание действия или меню

source: Unable to drop here as parent is not writable
ru: Не удалось выполнить перетаскивание, так как родитель не поддерживает запись

source: Unable to drop here as level zero is not writable
ru: Не удалось выполнить перетаскивание, так как запись на нулевой уровень запрещена

source: Some messages have occurred during drop operation.
ru: Во время операции перетаскивания были получены некоторые сообщения.

source: The BaseWindow parent
ru: Родитель BaseWindow

source: Container
ru: Контейнер

source: A GtkContainer which contains the GtkTreeView widget
ru: Объект GtkContainer, который содержит виджет GtkTreeView

source: Widget name
ru: Имя виджета

source: The name of GtkTreeView widget
ru: Имя виджета GtkTreeView

source: Management mode
ru: Режим управления

source: Management mode of the tree view, selection or edition
ru: Режим управления иерархическим представлением, выделение или редактирование

source: Allow notify
ru: Разрешить уведомления

source: Whether notifications are allowed
ru: Разрешены ли уведомления

source: End of session
ru: Конец сеанса

source: _Save and quit
ru: _Сохранить и выйти

source: _Quit without saving
ru: _Выйти без сохранения

source: <span size="larger"><b>Parameter Legend</b></span>
ru: <span size="larger"><b>Возможные аргументы</b></span>

source: (first) basename.
ru: (первое) базовое имя.

source: space-separated list of the basenames of the selected file(s)/folder(s).
ru: разделённый пробелами список базовых имён выбранных файлов/папок.

source: count of selected item(s).
ru: количество выбранных элементов.

source: (first) base directory.
ru: (первый) базовый каталог.

source: space-separated list of the base directories of the selected file(s)/folder(s).
ru: разделённый пробелами список базовых каталогов выбранных файлов/папок.

source: port number of the (first) selected URI.
ru: номер порта (первого) выбранного URI.

source: scheme of the (first) selected URI.
ru: схема (первого) выбранного URI.

source: (first) URI.
ru: (первый) URI.

source: space-separated list of the URIs of the selected file(s)/folder(s).
ru: разделённый пробелами список URI выбранных файлов/папок.

source: a percent sign.
ru: знак процента.

source: (first) filename.
ru: (первое) имя файла.

source: space-separated list of the filenames of the selected file(s)/folder(s).
ru: разделённый пробелами список имён выбранных файлов/папок.

source: hostname of the (first) selected URI.
ru: имя узла (первого) выбранного URI.

source: username of the (first) selected URI.
ru: имя пользователя (первого) выбранного URI.

source: (first) basename without the extension.
ru: (первое) базовое имя без расширения.

source: space-separated list of the basenames without the extension.
ru: разделённый пробелами список базовых имён без расширения.

source: (first) extension.
ru: (первое) расширение.

source: space-separated list of the extensions of the selected file(s)/folder(s).
ru: разделённый пробелами список расширений выбранных файлов/папок.

source: (first) mimetype.
ru: (первый) тип MIME.

source: space-separated list of the mimetypes of the selected file(s)/folder(s).
ru: разделённый пробелами список типов MIME выбранных файлов/папок.

source: no-op operator which forces a singular form of execution.
ru: фиктивный оператор, который принудительно задаёт выполнение действия в одном файле.

source: no-op operator which forces a plural form of execution.
ru: фиктивный оператор, который принудительно задаёт выполнение действия одновременно в нескольких файлах.

source: Items _list :
ru: _Список элементов:

source: Sort the list in descending alphabetical order.
ru: Упорядочить список по алфавиту в порядке убывания.

source: Do not sort the list, letting you manually reorder the items.
ru: Не сортировать список (предоставить пользователю возможность изменять порядок элементов вручную).

source: Sort the list in ascending alphabetical order.
ru: Упорядочить список по алфавиту в порядке возрастания.

source: Display item in _selection context menu
ru: Показать элемент в контекстном меню _выделения

source: When checked, the item will be candidate to be displayed in the file manager context menu, with a non-empty selection.
ru: Если этот параметр отмечен, элемент будет кандидатом на отображение в контекстном меню диспетчера файлов при условии непустого выделения.

source: The label of the item in the file manager context menus.
ru: Подпись элемента в контекстных меню диспетчера файлов.

source: _Context label :
ru: _Контекстная подпись:

source: Display item in _location context menu
ru: Показать элемент в контекстном меню _расположения

source: When checked, the item will be candidate to be displayed in the file manager context menu when the selection is empty. In this case, the defined conditions will be applied to the current displayed folder.
ru: Если этот параметр отмечен, элемент будет кандидатом на отображение в контекстном меню диспетчера файлов при условии пустого выделения. В этом случае заданные условия будут применены к текущей отображаемой папке.

source: Display item in the _toolbar
ru: Показать элемент в _панели инструментов

source: When checked, the item will be candidate to be displayed in the file manager toolbar. In this case, the defined conditions will be applied to the current folder, and do not depend of the possible current selection.
ru: Если этот параметр отмечен, элемент будет кандидатом на отображение в панели инструментов диспетчера файлов. В этом случае заданные условия будут применены к текущей папке и не зависят от возможного текущего выделения.

source: Use s_ame label for icon in the toolbar
ru: Использовать _ту же подпись для значка в панели инструментов

source: When checked, the label displayed in the toolbar will be the same that the one displayed in the context menus.
ru: Если этот параметр отмечен, в панели инструментов будет показана та же подпись, что и в контекстных меню.

source: The label displayed in the file manager toolbar.
ru: Подпись, которая отображается в панели инструментов диспетчера файлов.

source: T_oolbar label :
ru: Подпись _панели инструментов:

source: Toolti_p :
ru: _Подсказка:

source: _Icon :
ru: _Значок:

source: The tooltip displayed in the file manager user interface.
ru: Всплывающая подсказка, которая отображается в интерфейсе пользователя диспетчера файлов.

source: The icon displayed in the file manager user interface.
ru: Значок, который отображается в интерфейсе пользователя диспетчера файлов.

source: The name of a themed icon or the filename of an image.
ru: Имя тематического значка или имя файла изображения.

source: _Browse...
ru: _Обзор...

source: <b>Caja Item</b>
ru: <b>Элемент Caja</b>

source: This tab lets you determine the main characteristics of the currently selected item.
ru: На этой вкладке можно определить главные характеристики текущего выбранного элемента.

source: Just a label to remind you why you have created this profile.
ru: Просто подпись, которая напомнит о цели создания этого профиля.

source: _Label :
ru: _Подпись:

source: <b>Profile</b>
ru: <b>Профиль</b>

source: _Path :
ru: _Путь:

source: P_arameters :
ru: П_араметры:

source: The path of the command. If this is not an absolute path, then the PATH environment variable at execution time will be considered.
ru: Путь к команде. Если указан не абсолютный путь, при выполнении будет использоваться переменная среды PATH.

source: The parameters of the command.
ru: Параметры команды.

source: Le_gend
ru: Ле_генда

source: _Working directory :
ru: _Рабочий каталог:
